#include "drawing_objects.h"

namespace rr::ui {

// Fragment content (character indices)
const std::array<uint8_t, fragment_content_size> fragment_content = {
    // nr: "0"
    0,

    // "1"
    1,

    // "2"
    2,

    // "3"
    3,

    // "4"
    4,

    // "5"
    5,

    // "6"
    6,

    // "7"
    7,

    // "8"
    8,

    // "9"
    9,

    // colon: ":"
    10,

    // space: " "
    11,

    // bell: "🔔"
    63,

    // run: "run"
    45, 48, 41,

    // stop: "stop"
    46, 47, 42, 43,

    // alarm: "alarm"
    29, 39, 29, 45, 40,

    // hour: "hour"
    36, 42, 48, 45,

    // minute: "minute"
    40, 37, 41, 48, 47, 33,

    // set: "set"
    46, 33, 47,

    // day: "day"
    32, 29, 51,

    // month: "month"
    40, 42, 41, 47, 36,

    // year: "year"
    51, 33, 29, 45,

    // annee: "Année "
    14, 41, 41, 56, 33, 11,

    // decade: " Décade "
    11, 16, 56, 31, 29, 32, 33, 11,

    // jourdu: "Jour "
    19, 42, 48, 45, 11,

    // jourepagomene: "Jour épagomène"
    19, 42, 48, 45, 11, 56, 43, 29, 35, 42, 40, 55, 41, 33,

    // on_off: "on"
    42, 41,

    // "off"
    42, 34, 34,

    // months: "Vendémiaire"
    28, 33, 41, 32, 56, 40, 37, 29, 37, 45, 33,

    // "Brumaire"
    15, 45, 48, 40, 29, 37, 45, 33,

    // "Frimaire"
    17, 45, 37, 40, 29, 37, 45, 33,

    // "Nivôse"
    21, 37, 49, 60, 46, 33,

    // "Pluviôse"
    23, 39, 48, 49, 37, 60, 46, 33,

    // "Ventôse"
    28, 33, 41, 47, 60, 46, 33,

    // "Germinal"
    18, 33, 45, 40, 37, 41, 29, 39,

    // "Floréal"
    17, 39, 42, 45, 56, 29, 39,

    // "Prairial"
    23, 45, 29, 37, 45, 37, 29, 39,

    // "Messidor"
    20, 33, 46, 46, 37, 32, 42, 45,

    // "Thermidor"
    27, 36, 33, 45, 40, 37, 32, 42, 45,

    // "Fructidor"
    17, 45, 48, 31, 47, 37, 32, 42, 45,

    // days: "Primidi"
    23, 45, 37, 40, 37, 32, 37,

    // "Duodi"
    16, 48, 42, 32, 37,

    // "Tridi"
    27, 45, 37, 32, 37,

    // "Quartidi"
    24, 48, 29, 45, 47, 37, 32, 37,

    // "Quintidi"
    24, 48, 37, 41, 47, 37, 32, 37,

    // "Sextidi"
    26, 33, 50, 47, 37, 32, 37,

    // "Septidi"
    26, 33, 43, 47, 37, 32, 37,

    // "Octidi"
    22, 31, 47, 37, 32, 37,

    // "Nonidi"
    21, 42, 41, 37, 32, 37,

    // "Décadi"
    16, 56, 31, 29, 32, 37,

    // sansculottides: "Fête de la Vertu"
    17, 57, 47, 33, 11, 32, 33, 11, 39, 29, 11, 28, 33, 45, 47, 48,

    // "Fête du Génie"
    17, 57, 47, 33, 11, 32, 48, 11, 18, 56, 41, 37, 33,

    // "Fête du Travail"
    17, 57, 47, 33, 11, 32, 48, 11, 27, 45, 29, 49, 29, 37, 39,

    // "Fête de l'Opinion"
    17, 57, 47, 33, 11, 32, 33, 11, 39, 12, 22, 43, 37, 41, 37, 42, 41,

    // "Fête des Récompenses"
    17, 57, 47, 33, 11, 32, 33, 46, 11, 25, 56, 31, 42, 40, 43, 33, 41, 46, 33, 46,

    // "Fête de la Révolution"
    17, 57, 47, 33, 11, 32, 33, 11, 39, 29, 11, 25, 56, 49, 42, 39, 48, 47, 37, 42, 41,

    // day_of_year: "du raisin"
    32, 48, 11, 45, 29, 37, 46, 37, 41,

    // "du safran"
    32, 48, 11, 46, 29, 34, 45, 29, 41,

    // "de la châtaigne"
    32, 33, 11, 39, 29, 11, 31, 36, 54, 47, 29, 37, 35, 41, 33,

    // "du colchique"
    32, 48, 11, 31, 42, 39, 31, 36, 37, 44, 48, 33,

    // "du cheval"
    32, 48, 11, 31, 36, 33, 49, 29, 39,

    // "de la balsamine"
    32, 33, 11, 39, 29, 11, 30, 29, 39, 46, 29, 40, 37, 41, 33,

    // "de la carotte"
    32, 33, 11, 39, 29, 11, 31, 29, 45, 42, 47, 47, 33,

    // "de l'amarante"
    32, 33, 11, 39, 12, 29, 40, 29, 45, 29, 41, 47, 33,

    // "du panais"
    32, 48, 11, 43, 29, 41, 29, 37, 46,

    // "de la cuve"
    32, 33, 11, 39, 29, 11, 31, 48, 49, 33,

    // "de la pomme de terre"
    32, 33, 11, 39, 29, 11, 43, 42, 40, 40, 33, 11, 32, 33, 11, 47, 33, 45, 45, 33,

    // "de l'immortelle"
    32, 33, 11, 39, 12, 37, 40, 40, 42, 45, 47, 33, 39, 39, 33,

    // "du potiron"
    32, 48, 11, 43, 42, 47, 37, 45, 42, 41,

    // "du réséda"
    32, 48, 11, 45, 56, 46, 56, 32, 29,

    // "de l'âne"
    32, 33, 11, 39, 12, 54, 41, 33,

    // "de la belle de nuit"
    32, 33, 11, 39, 29, 11, 30, 33, 39, 39, 33, 11, 32, 33, 11, 41, 48, 37, 47,

    // "de la citrouille"
    32, 33, 11, 39, 29, 11, 31, 37, 47, 45, 42, 48, 37, 39, 39, 33,

    // "du sarrasin"
    32, 48, 11, 46, 29, 45, 45, 29, 46, 37, 41,

    // "du tournesol"
    32, 48, 11, 47, 42, 48, 45, 41, 33, 46, 42, 39,

    // "du pressoir"
    32, 48, 11, 43, 45, 33, 46, 46, 42, 37, 45,

    // "du chanvre"
    32, 48, 11, 31, 36, 29, 41, 49, 45, 33,

    // "de la pêche"
    32, 33, 11, 39, 29, 11, 43, 57, 31, 36, 33,

    // "du navet"
    32, 48, 11, 41, 29, 49, 33, 47,

    // "de l'amaryllis"
    32, 33, 11, 39, 12, 29, 40, 29, 45, 51, 39, 39, 37, 46,

    // "du bœuf"
    32, 48, 11, 30, 62, 48, 34,

    // "de l'aubergine"
    32, 33, 11, 39, 12, 29, 48, 30, 33, 45, 35, 37, 41, 33,

    // "du piment"
    32, 48, 11, 43, 37, 40, 33, 41, 47,

    // "de la tomate"
    32, 33, 11, 39, 29, 11, 47, 42, 40, 29, 47, 33,

    // "de l'orge"
    32, 33, 11, 39, 12, 42, 45, 35, 33,

    // "du tonneau"
    32, 48, 11, 47, 42, 41, 41, 33, 29, 48,

    // "de la pomme"
    32, 33, 11, 39, 29, 11, 43, 42, 40, 40, 33,

    // "du céleri"
    32, 48, 11, 31, 56, 39, 33, 45, 37,

    // "de la poire"
    32, 33, 11, 39, 29, 11, 43, 42, 37, 45, 33,

    // "de la betterave"
    32, 33, 11, 39, 29, 11, 30, 33, 47, 47, 33, 45, 29, 49, 33,

    // "de l'oie"
    32, 33, 11, 39, 12, 42, 37, 33,

    // "de l'héliotrope"
    32, 33, 11, 39, 12, 36, 56, 39, 37, 42, 47, 45, 42, 43, 33,

    // "de la figue"
    32, 33, 11, 39, 29, 11, 34, 37, 35, 48, 33,

    // "de la scorsonère"
    32, 33, 11, 39, 29, 11, 46, 31, 42, 45, 46, 42, 41, 55, 45, 33,

    // "de l'alisier"
    32, 33, 11, 39, 12, 29, 39, 37, 46, 37, 33, 45,

    // "de la charrue"
    32, 33, 11, 39, 29, 11, 31, 36, 29, 45, 45, 48, 33,

    // "du salsifis"
    32, 48, 11, 46, 29, 39, 46, 37, 34, 37, 46,

    // "de la macre"
    32, 33, 11, 39, 29, 11, 40, 29, 31, 45, 33,

    // "du topinambour"
    32, 48, 11, 47, 42, 43, 37, 41, 29, 40, 30, 42, 48, 45,

    // "de l'endive"
    32, 33, 11, 39, 12, 33, 41, 32, 37, 49, 33,

    // "du dindon"
    32, 48, 11, 32, 37, 41, 32, 42, 41,

    // "du chervis"
    32, 48, 11, 31, 36, 33, 45, 49, 37, 46,

    // "du cresson"
    32, 48, 11, 31, 45, 33, 46, 46, 42, 41,

    // "de la dentelaire"
    32, 33, 11, 39, 29, 11, 32, 33, 41, 47, 33, 39, 29, 37, 45, 33,

    // "de la grenade"
    32, 33, 11, 39, 29, 11, 35, 45, 33, 41, 29, 32, 33,

    // "de la herse"
    32, 33, 11, 39, 29, 11, 36, 33, 45, 46, 33,

    // "de la bacchante"
    32, 33, 11, 39, 29, 11, 30, 29, 31, 31, 36, 29, 41, 47, 33,

    // "de l'azerole"
    32, 33, 11, 39, 12, 29, 52, 33, 45, 42, 39, 33,

    // "de la garance"
    32, 33, 11, 39, 29, 11, 35, 29, 45, 29, 41, 31, 33,

    // "de l'orange"
    32, 33, 11, 39, 12, 42, 45, 29, 41, 35, 33,

    // "du faisan"
    32, 48, 11, 34, 29, 37, 46, 29, 41,

    // "de la pistache"
    32, 33, 11, 39, 29, 11, 43, 37, 46, 47, 29, 31, 36, 33,

    // "du macjonc"
    32, 48, 11, 40, 29, 31, 38, 42, 41, 31,

    // "du coing"
    32, 48, 11, 31, 42, 37, 41, 35,

    // "du cormier"
    32, 48, 11, 31, 42, 45, 40, 37, 33, 45,

    // "du rouleau"
    32, 48, 11, 45, 42, 48, 39, 33, 29, 48,

    // "de la raiponce"
    32, 33, 11, 39, 29, 11, 45, 29, 37, 43, 42, 41, 31, 33,

    // "du turneps"
    32, 48, 11, 47, 48, 45, 41, 33, 43, 46,

    // "de la chicorée"
    32, 33, 11, 39, 29, 11, 31, 36, 37, 31, 42, 45, 56, 33,

    // "de la nèfle"
    32, 33, 11, 39, 29, 11, 41, 55, 34, 39, 33,

    // "du cochon"
    32, 48, 11, 31, 42, 31, 36, 42, 41,

    // "de la mâche"
    32, 33, 11, 39, 29, 11, 40, 54, 31, 36, 33,

    // "du chou-fleur"
    32, 48, 11, 31, 36, 42, 48, 13, 34, 39, 33, 48, 45,

    // "du miel"
    32, 48, 11, 40, 37, 33, 39,

    // "du génépi"
    32, 48, 11, 35, 56, 41, 56, 43, 37,

    // "de la pioche"
    32, 33, 11, 39, 29, 11, 43, 37, 42, 31, 36, 33,

    // "de la cire"
    32, 33, 11, 39, 29, 11, 31, 37, 45, 33,

    // "du raifort"
    32, 48, 11, 45, 29, 37, 34, 42, 45, 47,

    // "du cèdre"
    32, 48, 11, 31, 55, 32, 45, 33,

    // "du sapin"
    32, 48, 11, 46, 29, 43, 37, 41,

    // "du chevreuil"
    32, 48, 11, 31, 36, 33, 49, 45, 33, 48, 37, 39,

    // "de l'ajonc"
    32, 33, 11, 39, 12, 29, 38, 42, 41, 31,

    // "du cyprès"
    32, 48, 11, 31, 51, 43, 45, 55, 46,

    // "du lierre"
    32, 48, 11, 39, 37, 33, 45, 45, 33,

    // "de la sabine"
    32, 33, 11, 39, 29, 11, 46, 29, 30, 37, 41, 33,

    // "de la hoye"
    32, 33, 11, 39, 29, 11, 36, 42, 51, 33,

    // "de l'érable sucré"
    32, 33, 11, 39, 12, 56, 45, 29, 30, 39, 33, 11, 46, 48, 31, 45, 56,

    // "de la bruyère"
    32, 33, 11, 39, 29, 11, 30, 45, 48, 51, 55, 45, 33,

    // "du roseau"
    32, 48, 11, 45, 42, 46, 33, 29, 48,

    // "de l'oseille"
    32, 33, 11, 39, 12, 42, 46, 33, 37, 39, 39, 33,

    // "du grillon"
    32, 48, 11, 35, 45, 37, 39, 39, 42, 41,

    // "du pignon"
    32, 48, 11, 43, 37, 35, 41, 42, 41,

    // "du liège"
    32, 48, 11, 39, 37, 55, 35, 33,

    // "de la truffe"
    32, 33, 11, 39, 29, 11, 47, 45, 48, 34, 34, 33,

    // "de l'olive"
    32, 33, 11, 39, 12, 42, 39, 37, 49, 33,

    // "de la pelle"
    32, 33, 11, 39, 29, 11, 43, 33, 39, 39, 33,

    // "de la tourbe"
    32, 33, 11, 39, 29, 11, 47, 42, 48, 45, 30, 33,

    // "de la houille"
    32, 33, 11, 39, 29, 11, 36, 42, 48, 37, 39, 39, 33,

    // "du bitume"
    32, 48, 11, 30, 37, 47, 48, 40, 33,

    // "du soufre"
    32, 48, 11, 46, 42, 48, 34, 45, 33,

    // "du chien"
    32, 48, 11, 31, 36, 37, 33, 41,

    // "de la lave"
    32, 33, 11, 39, 29, 11, 39, 29, 49, 33,

    // "de la terre végétale"
    32, 33, 11, 39, 29, 11, 47, 33, 45, 45, 33, 11, 49, 56, 35, 56, 47, 29, 39, 33,

    // "du fumier"
    32, 48, 11, 34, 48, 40, 37, 33, 45,

    // "du salpêtre"
    32, 48, 11, 46, 29, 39, 43, 57, 47, 45, 33,

    // "du fléau"
    32, 48, 11, 34, 39, 56, 29, 48,

    // "du granite"
    32, 48, 11, 35, 45, 29, 41, 37, 47, 33,

    // "de l'argile"
    32, 33, 11, 39, 12, 29, 45, 35, 37, 39, 33,

    // "de l'ardoise"
    32, 33, 11, 39, 12, 29, 45, 32, 42, 37, 46, 33,

    // "du grès"
    32, 48, 11, 35, 45, 55, 46,

    // "du lapin"
    32, 48, 11, 39, 29, 43, 37, 41,

    // "du silex"
    32, 48, 11, 46, 37, 39, 33, 50,

    // "de la marne"
    32, 33, 11, 39, 29, 11, 40, 29, 45, 41, 33,

    // "de la pierre à chaux"
    32, 33, 11, 39, 29, 11, 43, 37, 33, 45, 45, 33, 11, 53, 11, 31, 36, 29, 48, 50,

    // "du marbre"
    32, 48, 11, 40, 29, 45, 30, 45, 33,

    // "du van"
    32, 48, 11, 49, 29, 41,

    // "de la pierre à plâtre"
    32, 33, 11, 39, 29, 11, 43, 37, 33, 45, 45, 33, 11, 53, 11, 43, 39, 54, 47, 45, 33,

    // "du sel"
    32, 48, 11, 46, 33, 39,

    // "du fer"
    32, 48, 11, 34, 33, 45,

    // "du cuivre"
    32, 48, 11, 31, 48, 37, 49, 45, 33,

    // "du chat"
    32, 48, 11, 31, 36, 29, 47,

    // "de l'étain"
    32, 33, 11, 39, 12, 56, 47, 29, 37, 41,

    // "du plomb"
    32, 48, 11, 43, 39, 42, 40, 30,

    // "du zinc"
    32, 48, 11, 52, 37, 41, 31,

    // "du mercure"
    32, 48, 11, 40, 33, 45, 31, 48, 45, 33,

    // "du crible"
    32, 48, 11, 31, 45, 37, 30, 39, 33,

    // "de la lauréole"
    32, 33, 11, 39, 29, 11, 39, 29, 48, 45, 56, 42, 39, 33,

    // "de la mousse"
    32, 33, 11, 39, 29, 11, 40, 42, 48, 46, 46, 33,

    // "du fragon"
    32, 48, 11, 34, 45, 29, 35, 42, 41,

    // "de la pervenche"
    32, 33, 11, 39, 29, 11, 43, 33, 45, 49, 33, 41, 31, 36, 33,

    // "du taureau"
    32, 48, 11, 47, 29, 48, 45, 33, 29, 48,

    // "du laurier-tin"
    32, 48, 11, 39, 29, 48, 45, 37, 33, 45, 13, 47, 37, 41,

    // "de l'amatyste"
    32, 33, 11, 39, 12, 29, 40, 29, 47, 51, 46, 47, 33,

    // "du mézéréon"
    32, 48, 11, 40, 56, 52, 56, 45, 56, 42, 41,

    // "du peuplier"
    32, 48, 11, 43, 33, 48, 43, 39, 37, 33, 45,

    // "de la coignée"
    32, 33, 11, 39, 29, 11, 31, 42, 37, 35, 41, 56, 33,

    // "de l'ellébore"
    32, 33, 11, 39, 12, 33, 39, 39, 56, 30, 42, 45, 33,

    // "du brocoli"
    32, 48, 11, 30, 45, 42, 31, 42, 39, 37,

    // "du laurier"
    32, 48, 11, 39, 29, 48, 45, 37, 33, 45,

    // "de l'avelinier"
    32, 33, 11, 39, 12, 29, 49, 33, 39, 37, 41, 37, 33, 45,

    // "de la vache"
    32, 33, 11, 39, 29, 11, 49, 29, 31, 36, 33,

    // "du buis"
    32, 48, 11, 30, 48, 37, 46,

    // "du lichén"
    32, 48, 11, 39, 37, 31, 36, 56, 41,

    // "de l'if"
    32, 33, 11, 39, 12, 37, 34,

    // "de la pulmonaire"
    32, 33, 11, 39, 29, 11, 43, 48, 39, 40, 42, 41, 29, 37, 45, 33,

    // "de la serpette"
    32, 33, 11, 39, 29, 11, 46, 33, 45, 43, 33, 47, 47, 33,

    // "du thlaspi"
    32, 48, 11, 47, 36, 39, 29, 46, 43, 37,

    // "du thimelé"
    32, 48, 11, 47, 36, 37, 40, 33, 39, 56,

    // "du chiendent"
    32, 48, 11, 31, 36, 37, 33, 41, 32, 33, 41, 47,

    // "de la traînasse"
    32, 33, 11, 39, 29, 11, 47, 45, 29, 58, 41, 29, 46, 46, 33,

    // "du lièvre"
    32, 48, 11, 39, 37, 55, 49, 45, 33,

    // "de la guède"
    32, 33, 11, 39, 29, 11, 35, 48, 55, 32, 33,

    // "du noisetier"
    32, 48, 11, 41, 42, 37, 46, 33, 47, 37, 33, 45,

    // "du cyclamen"
    32, 48, 11, 31, 51, 31, 39, 29, 40, 33, 41,

    // "de la chélidoine"
    32, 33, 11, 39, 29, 11, 31, 36, 56, 39, 37, 32, 42, 37, 41, 33,

    // "du traîneau"
    32, 48, 11, 47, 45, 29, 58, 41, 33, 29, 48,

    // "du tussilage"
    32, 48, 11, 47, 48, 46, 46, 37, 39, 29, 35, 33,

    // "du cornouiller"
    32, 48, 11, 31, 42, 45, 41, 42, 48, 37, 39, 39, 33, 45,

    // "du violier"
    32, 48, 11, 49, 37, 42, 39, 37, 33, 45,

    // "du troène"
    32, 48, 11, 47, 45, 42, 55, 41, 33,

    // "du bouc"
    32, 48, 11, 30, 42, 48, 31,

    // "de l'asaret"
    32, 33, 11, 39, 12, 29, 46, 29, 45, 33, 47,

    // "de l'alaterne"
    32, 33, 11, 39, 12, 29, 39, 29, 47, 33, 45, 41, 33,

    // "de la violette"
    32, 33, 11, 39, 29, 11, 49, 37, 42, 39, 33, 47, 47, 33,

    // "du marceau"
    32, 48, 11, 40, 29, 45, 31, 33, 29, 48,

    // "de la bêche"
    32, 33, 11, 39, 29, 11, 30, 57, 31, 36, 33,

    // "du narcisse"
    32, 48, 11, 41, 29, 45, 31, 37, 46, 46, 33,

    // "de l'orme"
    32, 33, 11, 39, 12, 42, 45, 40, 33,

    // "de la fumeterre"
    32, 33, 11, 39, 29, 11, 34, 48, 40, 33, 47, 33, 45, 45, 33,

    // "du vélar"
    32, 48, 11, 49, 56, 39, 29, 45,

    // "de la chèvre"
    32, 33, 11, 39, 29, 11, 31, 36, 55, 49, 45, 33,

    // "de l'épinard"
    32, 33, 11, 39, 12, 56, 43, 37, 41, 29, 45, 32,

    // "du doronic"
    32, 48, 11, 32, 42, 45, 42, 41, 37, 31,

    // "du mouron"
    32, 48, 11, 40, 42, 48, 45, 42, 41,

    // "du cerfeuil"
    32, 48, 11, 31, 33, 45, 34, 33, 48, 37, 39,

    // "du cordeau"
    32, 48, 11, 31, 42, 45, 32, 33, 29, 48,

    // "de la mandragore"
    32, 33, 11, 39, 29, 11, 40, 29, 41, 32, 45, 29, 35, 42, 45, 33,

    // "du persil"
    32, 48, 11, 43, 33, 45, 46, 37, 39,

    // "du cochléaria"
    32, 48, 11, 31, 42, 31, 36, 39, 56, 29, 45, 37, 29,

    // "de la pâquerette"
    32, 33, 11, 39, 29, 11, 43, 54, 44, 48, 33, 45, 33, 47, 47, 33,

    // "du thon"
    32, 48, 11, 47, 36, 42, 41,

    // "du pissenlit"
    32, 48, 11, 43, 37, 46, 46, 33, 41, 39, 37, 47,

    // "de la sylvie"
    32, 33, 11, 39, 29, 11, 46, 51, 39, 49, 37, 33,

    // "du capillaire"
    32, 48, 11, 31, 29, 43, 37, 39, 39, 29, 37, 45, 33,

    // "du frêne"
    32, 48, 11, 34, 45, 57, 41, 33,

    // "du plantoir"
    32, 48, 11, 43, 39, 29, 41, 47, 42, 37, 45,

    // "de la primevère"
    32, 33, 11, 39, 29, 11, 43, 45, 37, 40, 33, 49, 55, 45, 33,

    // "du platane"
    32, 48, 11, 43, 39, 29, 47, 29, 41, 33,

    // "de l'asperge"
    32, 33, 11, 39, 12, 29, 46, 43, 33, 45, 35, 33,

    // "de la tulipe"
    32, 33, 11, 39, 29, 11, 47, 48, 39, 37, 43, 33,

    // "de la poule"
    32, 33, 11, 39, 29, 11, 43, 42, 48, 39, 33,

    // "de la bette"
    32, 33, 11, 39, 29, 11, 30, 33, 47, 47, 33,

    // "du bouleau"
    32, 48, 11, 30, 42, 48, 39, 33, 29, 48,

    // "de la jonquille"
    32, 33, 11, 39, 29, 11, 38, 42, 41, 44, 48, 37, 39, 39, 33,

    // "de l'aulne"
    32, 33, 11, 39, 12, 29, 48, 39, 41, 33,

    // "du couvoir"
    32, 48, 11, 31, 42, 48, 49, 42, 37, 45,

    // "du perce-neige"
    32, 48, 11, 43, 33, 45, 31, 33, 13, 41, 33, 37, 35, 33,

    // "du crocus"
    32, 48, 11, 31, 45, 42, 31, 48, 46,

    // "du hêtre"
    32, 48, 11, 36, 57, 47, 45, 33,

    // "de la laitue"
    32, 33, 11, 39, 29, 11, 39, 29, 37, 47, 48, 33,

    // "du torillon"
    32, 48, 11, 47, 42, 45, 37, 39, 39, 42, 41,

    // "du lilas"
    32, 48, 11, 39, 37, 39, 29, 46,

    // "de l'anémone"
    32, 33, 11, 39, 12, 29, 41, 56, 40, 42, 41, 33,

    // "de la pensée"
    32, 33, 11, 39, 29, 11, 43, 33, 41, 46, 56, 33,

    // "de la myrtille"
    32, 33, 11, 39, 29, 11, 40, 51, 45, 47, 37, 39, 39, 33,

    // "du greffoir"
    32, 48, 11, 35, 45, 33, 34, 34, 42, 37, 45,

    // "du cerisier"
    32, 48, 11, 31, 33, 45, 37, 46, 37, 33, 45,

    // "de la verveine"
    32, 33, 11, 39, 29, 11, 49, 33, 45, 49, 33, 37, 41, 33,

    // "du grenadier"
    32, 48, 11, 35, 45, 33, 41, 29, 32, 37, 33, 45,

    // "du vernal"
    32, 48, 11, 49, 33, 45, 41, 29, 39,

    // "du cheval"
    32, 48, 11, 31, 36, 33, 49, 29, 39,

    // "de la brenèche"
    32, 33, 11, 39, 29, 11, 30, 45, 33, 41, 55, 31, 36, 33,

    // "du charme"
    32, 48, 11, 31, 36, 29, 45, 40, 33,

    // "de la morille"
    32, 33, 11, 39, 29, 11, 40, 42, 45, 37, 39, 39, 33,

    // "du hêtre enraciné"
    32, 48, 11, 36, 57, 47, 45, 33, 11, 33, 41, 45, 29, 31, 37, 41, 56,

    // "de la ruche"
    32, 33, 11, 39, 29, 11, 45, 48, 31, 36, 33,

    // "de la rose"
    32, 33, 11, 39, 29, 11, 45, 42, 46, 33,

    // "du chêne"
    32, 48, 11, 31, 36, 57, 41, 33,

    // "de la fougère"
    32, 33, 11, 39, 29, 11, 34, 42, 48, 35, 55, 45, 33,

    // "de l'aubépine"
    32, 33, 11, 39, 12, 29, 48, 30, 56, 43, 37, 41, 33,

    // "du rossignol"
    32, 48, 11, 45, 42, 46, 46, 37, 35, 41, 42, 39,

    // "de l'ancolie"
    32, 33, 11, 39, 12, 29, 41, 31, 42, 39, 37, 33,

    // "du muguet"
    32, 48, 11, 40, 48, 35, 48, 33, 47,

    // "du champignon"
    32, 48, 11, 31, 36, 29, 40, 43, 37, 35, 41, 42, 41,

    // "de l'hyacinthe"
    32, 33, 11, 39, 12, 36, 51, 29, 31, 37, 41, 47, 36, 33,

    // "du râteau"
    32, 48, 11, 45, 54, 47, 33, 29, 48,

    // "de la rhubarbe"
    32, 33, 11, 39, 29, 11, 45, 36, 48, 30, 29, 45, 30, 33,

    // "du sainfoin"
    32, 48, 11, 46, 29, 37, 41, 34, 42, 37, 41,

    // "du bâton-d'or"
    32, 48, 11, 30, 54, 47, 42, 41, 13, 32, 12, 42, 45,

    // "du chamerisier"
    32, 48, 11, 31, 36, 29, 40, 33, 45, 37, 46, 37, 33, 45,

    // "du ver à soie"
    32, 48, 11, 49, 33, 45, 11, 53, 11, 46, 42, 37, 33,

    // "de la consoude"
    32, 33, 11, 39, 29, 11, 31, 42, 41, 46, 42, 48, 32, 33,

    // "de la pimprenelle"
    32, 33, 11, 39, 29, 11, 43, 37, 40, 43, 45, 33, 41, 33, 39, 39, 33,

    // "de la corbeille d'or"
    32, 33, 11, 39, 29, 11, 31, 42, 45, 30, 33, 37, 39, 39, 33, 11, 32, 12, 42, 45,

    // "de l'arroche"
    32, 33, 11, 39, 12, 29, 45, 45, 42, 31, 36, 33,

    // "du sarcloir"
    32, 48, 11, 46, 29, 45, 31, 39, 42, 37, 45,

    // "de la statice"
    32, 33, 11, 39, 29, 11, 46, 47, 29, 47, 37, 31, 33,

    // "de la fritillaire"
    32, 33, 11, 39, 29, 11, 34, 45, 37, 47, 37, 39, 39, 29, 37, 45, 33,

    // "de la bourache"
    32, 33, 11, 39, 29, 11, 30, 42, 48, 45, 29, 31, 36, 33,

    // "de la valériane"
    32, 33, 11, 39, 29, 11, 49, 29, 39, 56, 45, 37, 29, 41, 33,

    // "de la carpe"
    32, 33, 11, 39, 29, 11, 31, 29, 45, 43, 33,

    // "du fusain"
    32, 48, 11, 34, 48, 46, 29, 37, 41,

    // "de la civette"
    32, 33, 11, 39, 29, 11, 31, 37, 49, 33, 47, 47, 33,

    // "de la buglosse"
    32, 33, 11, 39, 29, 11, 30, 48, 35, 39, 42, 46, 46, 33,

    // "du sénevé"
    32, 48, 11, 46, 56, 41, 33, 49, 56,

    // "de la houlette"
    32, 33, 11, 39, 29, 11, 36, 42, 48, 39, 33, 47, 47, 33,

    // "de la luzerne"
    32, 33, 11, 39, 29, 11, 39, 48, 52, 33, 45, 41, 33,

    // "de l'hémérocalle"
    32, 33, 11, 39, 12, 36, 56, 40, 56, 45, 42, 31, 29, 39, 39, 33,

    // "du trèfle"
    32, 48, 11, 47, 45, 55, 34, 39, 33,

    // "de l'angélique"
    32, 33, 11, 39, 12, 29, 41, 35, 56, 39, 37, 44, 48, 33,

    // "du canard"
    32, 48, 11, 31, 29, 41, 29, 45, 32,

    // "de la mélisse"
    32, 33, 11, 39, 29, 11, 40, 56, 39, 37, 46, 46, 33,

    // "du fromental"
    32, 48, 11, 34, 45, 42, 40, 33, 41, 47, 29, 39,

    // "du martagon"
    32, 48, 11, 40, 29, 45, 47, 29, 35, 42, 41,

    // "du serpolet"
    32, 48, 11, 46, 33, 45, 43, 42, 39, 33, 47,

    // "de la faux"
    32, 33, 11, 39, 29, 11, 34, 29, 48, 50,

    // "de la fraise"
    32, 33, 11, 39, 29, 11, 34, 45, 29, 37, 46, 33,

    // "de la bétoine"
    32, 33, 11, 39, 29, 11, 30, 56, 47, 42, 37, 41, 33,

    // "du pois"
    32, 48, 11, 43, 42, 37, 46,

    // "de l'acacia"
    32, 33, 11, 39, 12, 29, 31, 29, 31, 37, 29,

    // "de la caille"
    32, 33, 11, 39, 29, 11, 31, 29, 37, 39, 39, 33,

    // "de l'œillet"
    32, 33, 11, 39, 12, 62, 37, 39, 39, 33, 47,

    // "du sureau"
    32, 48, 11, 46, 48, 45, 33, 29, 48,

    // "du pavot"
    32, 48, 11, 43, 29, 49, 42, 47,

    // "du tilleul"
    32, 48, 11, 47, 37, 39, 39, 33, 48, 39,

    // "de la fourche"
    32, 33, 11, 39, 29, 11, 34, 42, 48, 45, 31, 36, 33,

    // "du barbeau"
    32, 48, 11, 30, 29, 45, 30, 33, 29, 48,

    // "de la camomille"
    32, 33, 11, 39, 29, 11, 31, 29, 40, 42, 40, 37, 39, 39, 33,

    // "du chévrefeuille"
    32, 48, 11, 31, 36, 56, 49, 45, 33, 34, 33, 48, 37, 39, 39, 33,

    // "du caille-lait"
    32, 48, 11, 31, 29, 37, 39, 39, 33, 13, 39, 29, 37, 47,

    // "de la tanche"
    32, 33, 11, 39, 29, 11, 47, 29, 41, 31, 36, 33,

    // "du jasmin"
    32, 48, 11, 38, 29, 46, 40, 37, 41,

    // "de la verveine"
    32, 33, 11, 39, 29, 11, 49, 33, 45, 49, 33, 37, 41, 33,

    // "du thym"
    32, 48, 11, 47, 36, 51, 40,

    // "de la pivoine"
    32, 33, 11, 39, 29, 11, 43, 37, 49, 42, 37, 41, 33,

    // "du chariot"
    32, 48, 11, 31, 36, 29, 45, 37, 42, 47,

    // "du seigle"
    32, 48, 11, 46, 33, 37, 35, 39, 33,

    // "de l'avoine"
    32, 33, 11, 39, 12, 29, 49, 42, 37, 41, 33,

    // "de l'oignon"
    32, 33, 11, 39, 12, 42, 37, 35, 41, 42, 41,

    // "de la véronique"
    32, 33, 11, 39, 29, 11, 49, 56, 45, 42, 41, 37, 44, 48, 33,

    // "du mulet"
    32, 48, 11, 40, 48, 39, 33, 47,

    // "de la romaine"
    32, 33, 11, 39, 29, 11, 45, 42, 40, 29, 37, 41, 33,

    // "du concombre"
    32, 48, 11, 31, 42, 41, 31, 42, 40, 30, 45, 33,

    // "de l'échalote"
    32, 33, 11, 39, 12, 56, 31, 36, 29, 39, 42, 47, 33,

    // "de l'absinthe"
    32, 33, 11, 39, 12, 29, 30, 46, 37, 41, 47, 36, 33,

    // "de la faucille"
    32, 33, 11, 39, 29, 11, 34, 29, 48, 31, 37, 39, 39, 33,

    // "de la coriandre"
    32, 33, 11, 39, 29, 11, 31, 42, 45, 37, 29, 41, 32, 45, 33,

    // "de l'artichaut"
    32, 33, 11, 39, 12, 29, 45, 47, 37, 31, 36, 29, 48, 47,

    // "de la girofle"
    32, 33, 11, 39, 29, 11, 35, 37, 45, 42, 34, 39, 33,

    // "de la lavande"
    32, 33, 11, 39, 29, 11, 39, 29, 49, 29, 41, 32, 33,

    // "du chamois"
    32, 48, 11, 31, 36, 29, 40, 42, 37, 46,

    // "du tabac"
    32, 48, 11, 47, 29, 30, 29, 31,

    // "de la groseille"
    32, 33, 11, 39, 29, 11, 35, 45, 42, 46, 33, 37, 39, 39, 33,

    // "de la gesse"
    32, 33, 11, 39, 29, 11, 35, 33, 46, 46, 33,

    // "de la cerise"
    32, 33, 11, 39, 29, 11, 31, 33, 45, 37, 46, 33,

    // "du parc"
    32, 48, 11, 43, 29, 45, 31,

    // "de la menthe"
    32, 33, 11, 39, 29, 11, 40, 33, 41, 47, 36, 33,

    // "du cumin"
    32, 48, 11, 31, 48, 40, 37, 41,

    // "du haricot"
    32, 48, 11, 36, 29, 45, 37, 31, 42, 47,

    // "de l'orcanète"
    32, 33, 11, 39, 12, 42, 45, 31, 29, 41, 55, 47, 33,

    // "de la pintade"
    32, 33, 11, 39, 29, 11, 43, 37, 41, 47, 29, 32, 33,

    // "de la sauge"
    32, 33, 11, 39, 29, 11, 46, 29, 48, 35, 33,

    // "de l'ail"
    32, 33, 11, 39, 12, 29, 37, 39,

    // "de la vesce"
    32, 33, 11, 39, 29, 11, 49, 33, 46, 31, 33,

    // "du blé"
    32, 48, 11, 30, 39, 56,

    // "de la chalémie"
    32, 33, 11, 39, 29, 11, 31, 36, 29, 39, 56, 40, 37, 33,

    // "de l'épeautre"
    32, 33, 11, 39, 12, 56, 43, 33, 29, 48, 47, 45, 33,

    // "du bouillon-blanc"
    32, 48, 11, 30, 42, 48, 37, 39, 39, 42, 41, 13, 30, 39, 29, 41, 31,

    // "du melon"
    32, 48, 11, 40, 33, 39, 42, 41,

    // "de l'ivraie"
    32, 33, 11, 39, 12, 37, 49, 45, 29, 37, 33,

    // "du bélier"
    32, 48, 11, 30, 56, 39, 37, 33, 45,

    // "de la prêle"
    32, 33, 11, 39, 29, 11, 43, 45, 57, 39, 33,

    // "de l'armoise"
    32, 33, 11, 39, 12, 29, 45, 40, 42, 37, 46, 33,

    // "du carthame"
    32, 48, 11, 31, 29, 45, 47, 36, 29, 40, 33,

    // "de la mûre"
    32, 33, 11, 39, 29, 11, 40, 61, 45, 33,

    // "de l'arrosoir"
    32, 33, 11, 39, 12, 29, 45, 45, 42, 46, 42, 37, 45,

    // "du panis"
    32, 48, 11, 43, 29, 41, 37, 46,

    // "de la salicorne"
    32, 33, 11, 39, 29, 11, 46, 29, 39, 37, 31, 42, 45, 41, 33,

    // "de l'abricot"
    32, 33, 11, 39, 12, 29, 30, 45, 37, 31, 42, 47,

    // "du basilic"
    32, 48, 11, 30, 29, 46, 37, 39, 37, 31,

    // "de la brebis"
    32, 33, 11, 39, 29, 11, 30, 45, 33, 30, 37, 46,

    // "de la guimauve"
    32, 33, 11, 39, 29, 11, 35, 48, 37, 40, 29, 48, 49, 33,

    // "du lin"
    32, 48, 11, 39, 37, 41,

    // "de l'amande"
    32, 33, 11, 39, 12, 29, 40, 29, 41, 32, 33,

    // "de la gentiane"
    32, 33, 11, 39, 29, 11, 35, 33, 41, 47, 37, 29, 41, 33,

    // "de l'écluse"
    32, 33, 11, 39, 12, 56, 31, 39, 48, 46, 33,

    // "de la carline"
    32, 33, 11, 39, 29, 11, 31, 29, 45, 39, 37, 41, 33,

    // "du câprier"
    32, 48, 11, 31, 54, 43, 45, 37, 33, 45,

    // "de la lentille"
    32, 33, 11, 39, 29, 11, 39, 33, 41, 47, 37, 39, 39, 33,

    // "de l'aunée"
    32, 33, 11, 39, 12, 29, 48, 41, 56, 33,

    // "de la loutre"
    32, 33, 11, 39, 29, 11, 39, 42, 48, 47, 45, 33,

    // "du myrte"
    32, 48, 11, 40, 51, 45, 47, 33,

    // "du colza"
    32, 48, 11, 31, 42, 39, 52, 29,

    // "du lupin"
    32, 48, 11, 39, 48, 43, 37, 41,

    // "du coton"
    32, 48, 11, 31, 42, 47, 42, 41,

    // "du moulin"
    32, 48, 11, 40, 42, 48, 39, 37, 41,

    // "de la prune"
    32, 33, 11, 39, 29, 11, 43, 45, 48, 41, 33,

    // "du millet"
    32, 48, 11, 40, 37, 39, 39, 33, 47,

    // "du lycoperdon"
    32, 48, 11, 39, 51, 31, 42, 43, 33, 45, 32, 42, 41,

    // "de l'escourgeon"
    32, 33, 11, 39, 12, 33, 46, 31, 42, 48, 45, 35, 33, 42, 41,

    // "du saumon"
    32, 48, 11, 46, 29, 48, 40, 42, 41,

    // "de la tubéreuse"
    32, 33, 11, 39, 29, 11, 47, 48, 30, 56, 45, 33, 48, 46, 33,

    // "du sucrion"
    32, 48, 11, 46, 48, 31, 45, 37, 42, 41,

    // "de l'apocyn"
    32, 33, 11, 39, 12, 29, 43, 42, 31, 51, 41,

    // "de la réglisse"
    32, 33, 11, 39, 29, 11, 45, 56, 35, 39, 37, 46, 46, 33,

    // "de l'échelle"
    32, 33, 11, 39, 12, 56, 31, 36, 33, 39, 39, 33,

    // "de la pastèque"
    32, 33, 11, 39, 29, 11, 43, 29, 46, 47, 55, 44, 48, 33,

    // "du fenouil"
    32, 48, 11, 34, 33, 41, 42, 48, 37, 39,

    // "de l'épine-vinette"
    32, 33, 11, 39, 12, 56, 43, 37, 41, 33, 13, 49, 37, 41, 33, 47, 47, 33,

    // "de la noix"
    32, 33, 11, 39, 29, 11, 41, 42, 37, 50,

    // "de la truite"
    32, 33, 11, 39, 29, 11, 47, 45, 48, 37, 47, 33,

    // "du citron"
    32, 48, 11, 31, 37, 47, 45, 42, 41,

    // "de la cardère"
    32, 33, 11, 39, 29, 11, 31, 29, 45, 32, 55, 45, 33,

    // "du nerprun"
    32, 48, 11, 41, 33, 45, 43, 45, 48, 41,

    // "de la tagette"
    32, 33, 11, 39, 29, 11, 47, 29, 35, 33, 47, 47, 33,

    // "de la hotte"
    32, 33, 11, 39, 29, 11, 36, 42, 47, 47, 33,

    // "de l'églantier"
    32, 33, 11, 39, 12, 56, 35, 39, 29, 41, 47, 37, 33, 45,

    // "de la noisette"
    32, 33, 11, 39, 29, 11, 41, 42, 37, 46, 33, 47, 47, 33,

    // "du houblon"
    32, 48, 11, 36, 42, 48, 30, 39, 42, 41,

    // "du sorgho"
    32, 48, 11, 46, 42, 45, 35, 36, 42,

    // "de l'écrevisse"
    32, 33, 11, 39, 12, 56, 31, 45, 33, 49, 37, 46, 46, 33,

    // "de la bigarade"
    32, 33, 11, 39, 29, 11, 30, 37, 35, 29, 45, 29, 32, 33,

    // "de la verge d'or"
    32, 33, 11, 39, 29, 11, 49, 33, 45, 35, 33, 11, 32, 12, 42, 45,

    // "du maïs"
    32, 48, 11, 40, 29, 59, 46,

    // "du marron"
    32, 48, 11, 40, 29, 45, 45, 42, 41,

    // "du panier"
    32, 48, 11, 43, 29, 41, 37, 33, 45
};

// Fragment begin positions
const std::array<uint16_t, fragment_count> fragment_begin = {
    0, // nr: "0"
    1, // "1"
    2, // "2"
    3, // "3"
    4, // "4"
    5, // "5"
    6, // "6"
    7, // "7"
    8, // "8"
    9, // "9"
    10, // colon: ":"
    11, // space: " "
    12, // bell: "🔔"
    13, // run: "run"
    16, // stop: "stop"
    20, // alarm: "alarm"
    25, // hour: "hour"
    29, // minute: "minute"
    35, // set: "set"
    38, // day: "day"
    41, // month: "month"
    46, // year: "year"
    50, // annee: "Année "
    56, // decade: " Décade "
    64, // jourdu: "Jour "
    69, // jourepagomene: "Jour épagomène"
    83, // on_off: "on"
    85, // "off"
    88, // months: "Vendémiaire"
    99, // "Brumaire"
    107, // "Frimaire"
    115, // "Nivôse"
    121, // "Pluviôse"
    129, // "Ventôse"
    136, // "Germinal"
    144, // "Floréal"
    151, // "Prairial"
    159, // "Messidor"
    167, // "Thermidor"
    176, // "Fructidor"
    185, // days: "Primidi"
    192, // "Duodi"
    197, // "Tridi"
    202, // "Quartidi"
    210, // "Quintidi"
    218, // "Sextidi"
    225, // "Septidi"
    232, // "Octidi"
    238, // "Nonidi"
    244, // "Décadi"
    250, // sansculottides: "Fête de la Vertu"
    266, // "Fête du Génie"
    279, // "Fête du Travail"
    294, // "Fête de l'Opinion"
    311, // "Fête des Récompenses"
    331, // "Fête de la Révolution"
    352, // day_of_year: "du raisin"
    361, // "du safran"
    370, // "de la châtaigne"
    385, // "du colchique"
    397, // "du cheval"
    406, // "de la balsamine"
    421, // "de la carotte"
    434, // "de l'amarante"
    447, // "du panais"
    456, // "de la cuve"
    466, // "de la pomme de terre"
    486, // "de l'immortelle"
    501, // "du potiron"
    511, // "du réséda"
    520, // "de l'âne"
    528, // "de la belle de nuit"
    547, // "de la citrouille"
    563, // "du sarrasin"
    574, // "du tournesol"
    586, // "du pressoir"
    597, // "du chanvre"
    607, // "de la pêche"
    618, // "du navet"
    626, // "de l'amaryllis"
    640, // "du bœuf"
    647, // "de l'aubergine"
    661, // "du piment"
    670, // "de la tomate"
    682, // "de l'orge"
    691, // "du tonneau"
    701, // "de la pomme"
    712, // "du céleri"
    721, // "de la poire"
    732, // "de la betterave"
    747, // "de l'oie"
    755, // "de l'héliotrope"
    770, // "de la figue"
    781, // "de la scorsonère"
    797, // "de l'alisier"
    809, // "de la charrue"
    822, // "du salsifis"
    833, // "de la macre"
    844, // "du topinambour"
    858, // "de l'endive"
    869, // "du dindon"
    878, // "du chervis"
    888, // "du cresson"
    898, // "de la dentelaire"
    914, // "de la grenade"
    927, // "de la herse"
    938, // "de la bacchante"
    953, // "de l'azerole"
    965, // "de la garance"
    978, // "de l'orange"
    989, // "du faisan"
    998, // "de la pistache"
    1012, // "du macjonc"
    1022, // "du coing"
    1030, // "du cormier"
    1040, // "du rouleau"
    1050, // "de la raiponce"
    1064, // "du turneps"
    1074, // "de la chicorée"
    1088, // "de la nèfle"
    1099, // "du cochon"
    1108, // "de la mâche"
    1119, // "du chou-fleur"
    1132, // "du miel"
    1139, // "du génépi"
    1148, // "de la pioche"
    1160, // "de la cire"
    1170, // "du raifort"
    1180, // "du cèdre"
    1188, // "du sapin"
    1196, // "du chevreuil"
    1208, // "de l'ajonc"
    1218, // "du cyprès"
    1227, // "du lierre"
    1236, // "de la sabine"
    1248, // "de la hoye"
    1258, // "de l'érable sucré"
    1275, // "de la bruyère"
    1288, // "du roseau"
    1297, // "de l'oseille"
    1309, // "du grillon"
    1319, // "du pignon"
    1328, // "du liège"
    1336, // "de la truffe"
    1348, // "de l'olive"
    1358, // "de la pelle"
    1369, // "de la tourbe"
    1381, // "de la houille"
    1394, // "du bitume"
    1403, // "du soufre"
    1412, // "du chien"
    1420, // "de la lave"
    1430, // "de la terre végétale"
    1450, // "du fumier"
    1459, // "du salpêtre"
    1470, // "du fléau"
    1478, // "du granite"
    1488, // "de l'argile"
    1499, // "de l'ardoise"
    1511, // "du grès"
    1518, // "du lapin"
    1526, // "du silex"
    1534, // "de la marne"
    1545, // "de la pierre à chaux"
    1565, // "du marbre"
    1574, // "du van"
    1580, // "de la pierre à plâtre"
    1601, // "du sel"
    1607, // "du fer"
    1613, // "du cuivre"
    1622, // "du chat"
    1629, // "de l'étain"
    1639, // "du plomb"
    1647, // "du zinc"
    1654, // "du mercure"
    1664, // "du crible"
    1673, // "de la lauréole"
    1687, // "de la mousse"
    1699, // "du fragon"
    1708, // "de la pervenche"
    1723, // "du taureau"
    1733, // "du laurier-tin"
    1747, // "de l'amatyste"
    1760, // "du mézéréon"
    1771, // "du peuplier"
    1782, // "de la coignée"
    1795, // "de l'ellébore"
    1808, // "du brocoli"
    1818, // "du laurier"
    1828, // "de l'avelinier"
    1842, // "de la vache"
    1853, // "du buis"
    1860, // "du lichén"
    1869, // "de l'if"
    1876, // "de la pulmonaire"
    1892, // "de la serpette"
    1906, // "du thlaspi"
    1916, // "du thimelé"
    1926, // "du chiendent"
    1938, // "de la traînasse"
    1953, // "du lièvre"
    1962, // "de la guède"
    1973, // "du noisetier"
    1985, // "du cyclamen"
    1996, // "de la chélidoine"
    2012, // "du traîneau"
    2023, // "du tussilage"
    2035, // "du cornouiller"
    2049, // "du violier"
    2059, // "du troène"
    2068, // "du bouc"
    2075, // "de l'asaret"
    2086, // "de l'alaterne"
    2099, // "de la violette"
    2113, // "du marceau"
    2123, // "de la bêche"
    2134, // "du narcisse"
    2145, // "de l'orme"
    2154, // "de la fumeterre"
    2169, // "du vélar"
    2177, // "de la chèvre"
    2189, // "de l'épinard"
    2201, // "du doronic"
    2211, // "du mouron"
    2220, // "du cerfeuil"
    2231, // "du cordeau"
    2241, // "de la mandragore"
    2257, // "du persil"
    2266, // "du cochléaria"
    2279, // "de la pâquerette"
    2295, // "du thon"
    2302, // "du pissenlit"
    2314, // "de la sylvie"
    2326, // "du capillaire"
    2339, // "du frêne"
    2347, // "du plantoir"
    2358, // "de la primevère"
    2373, // "du platane"
    2383, // "de l'asperge"
    2395, // "de la tulipe"
    2407, // "de la poule"
    2418, // "de la bette"
    2429, // "du bouleau"
    2439, // "de la jonquille"
    2454, // "de l'aulne"
    2464, // "du couvoir"
    2474, // "du perce-neige"
    2488, // "du crocus"
    2497, // "du hêtre"
    2505, // "de la laitue"
    2517, // "du torillon"
    2528, // "du lilas"
    2536, // "de l'anémone"
    2548, // "de la pensée"
    2560, // "de la myrtille"
    2574, // "du greffoir"
    2585, // "du cerisier"
    2596, // "de la verveine"
    2610, // "du grenadier"
    2622, // "du vernal"
    2631, // "du cheval"
    2640, // "de la brenèche"
    2654, // "du charme"
    2663, // "de la morille"
    2676, // "du hêtre enraciné"
    2693, // "de la ruche"
    2704, // "de la rose"
    2714, // "du chêne"
    2722, // "de la fougère"
    2735, // "de l'aubépine"
    2748, // "du rossignol"
    2760, // "de l'ancolie"
    2772, // "du muguet"
    2781, // "du champignon"
    2794, // "de l'hyacinthe"
    2808, // "du râteau"
    2817, // "de la rhubarbe"
    2831, // "du sainfoin"
    2842, // "du bâton-d'or"
    2855, // "du chamerisier"
    2869, // "du ver à soie"
    2882, // "de la consoude"
    2896, // "de la pimprenelle"
    2913, // "de la corbeille d'or"
    2933, // "de l'arroche"
    2945, // "du sarcloir"
    2956, // "de la statice"
    2969, // "de la fritillaire"
    2986, // "de la bourache"
    3000, // "de la valériane"
    3015, // "de la carpe"
    3026, // "du fusain"
    3035, // "de la civette"
    3048, // "de la buglosse"
    3062, // "du sénevé"
    3071, // "de la houlette"
    3085, // "de la luzerne"
    3098, // "de l'hémérocalle"
    3114, // "du trèfle"
    3123, // "de l'angélique"
    3137, // "du canard"
    3146, // "de la mélisse"
    3159, // "du fromental"
    3171, // "du martagon"
    3182, // "du serpolet"
    3193, // "de la faux"
    3203, // "de la fraise"
    3215, // "de la bétoine"
    3228, // "du pois"
    3235, // "de l'acacia"
    3246, // "de la caille"
    3258, // "de l'œillet"
    3269, // "du sureau"
    3278, // "du pavot"
    3286, // "du tilleul"
    3296, // "de la fourche"
    3309, // "du barbeau"
    3319, // "de la camomille"
    3334, // "du chévrefeuille"
    3350, // "du caille-lait"
    3364, // "de la tanche"
    3376, // "du jasmin"
    3385, // "de la verveine"
    3399, // "du thym"
    3406, // "de la pivoine"
    3419, // "du chariot"
    3429, // "du seigle"
    3438, // "de l'avoine"
    3449, // "de l'oignon"
    3460, // "de la véronique"
    3475, // "du mulet"
    3483, // "de la romaine"
    3496, // "du concombre"
    3508, // "de l'échalote"
    3521, // "de l'absinthe"
    3534, // "de la faucille"
    3548, // "de la coriandre"
    3563, // "de l'artichaut"
    3577, // "de la girofle"
    3590, // "de la lavande"
    3603, // "du chamois"
    3613, // "du tabac"
    3621, // "de la groseille"
    3636, // "de la gesse"
    3647, // "de la cerise"
    3659, // "du parc"
    3666, // "de la menthe"
    3678, // "du cumin"
    3686, // "du haricot"
    3696, // "de l'orcanète"
    3709, // "de la pintade"
    3722, // "de la sauge"
    3733, // "de l'ail"
    3741, // "de la vesce"
    3752, // "du blé"
    3758, // "de la chalémie"
    3772, // "de l'épeautre"
    3785, // "du bouillon-blanc"
    3802, // "du melon"
    3810, // "de l'ivraie"
    3821, // "du bélier"
    3830, // "de la prêle"
    3841, // "de l'armoise"
    3853, // "du carthame"
    3864, // "de la mûre"
    3874, // "de l'arrosoir"
    3887, // "du panis"
    3895, // "de la salicorne"
    3910, // "de l'abricot"
    3922, // "du basilic"
    3932, // "de la brebis"
    3944, // "de la guimauve"
    3958, // "du lin"
    3964, // "de l'amande"
    3975, // "de la gentiane"
    3989, // "de l'écluse"
    4000, // "de la carline"
    4013, // "du câprier"
    4023, // "de la lentille"
    4037, // "de l'aunée"
    4047, // "de la loutre"
    4059, // "du myrte"
    4067, // "du colza"
    4075, // "du lupin"
    4083, // "du coton"
    4091, // "du moulin"
    4100, // "de la prune"
    4111, // "du millet"
    4120, // "du lycoperdon"
    4133, // "de l'escourgeon"
    4148, // "du saumon"
    4157, // "de la tubéreuse"
    4172, // "du sucrion"
    4182, // "de l'apocyn"
    4193, // "de la réglisse"
    4207, // "de l'échelle"
    4219, // "de la pastèque"
    4233, // "du fenouil"
    4243, // "de l'épine-vinette"
    4261, // "de la noix"
    4271, // "de la truite"
    4283, // "du citron"
    4292, // "de la cardère"
    4305, // "du nerprun"
    4315, // "de la tagette"
    4328, // "de la hotte"
    4339, // "de l'églantier"
    4353, // "de la noisette"
    4367, // "du houblon"
    4377, // "du sorgho"
    4386, // "de l'écrevisse"
    4400, // "de la bigarade"
    4414, // "de la verge d'or"
    4430, // "du maïs"
    4437, // "du marron"
    4446, // "du panier"
};

// Fragment lengths
const std::array<uint16_t, fragment_count> fragment_len = {
    1, // nr: "0"
    1, // "1"
    1, // "2"
    1, // "3"
    1, // "4"
    1, // "5"
    1, // "6"
    1, // "7"
    1, // "8"
    1, // "9"
    1, // colon: ":"
    1, // space: " "
    1, // bell: "🔔"
    3, // run: "run"
    4, // stop: "stop"
    5, // alarm: "alarm"
    4, // hour: "hour"
    6, // minute: "minute"
    3, // set: "set"
    3, // day: "day"
    5, // month: "month"
    4, // year: "year"
    6, // annee: "Année "
    8, // decade: " Décade "
    5, // jourdu: "Jour "
    14, // jourepagomene: "Jour épagomène"
    2, // on_off: "on"
    3, // "off"
    11, // months: "Vendémiaire"
    8, // "Brumaire"
    8, // "Frimaire"
    6, // "Nivôse"
    8, // "Pluviôse"
    7, // "Ventôse"
    8, // "Germinal"
    7, // "Floréal"
    8, // "Prairial"
    8, // "Messidor"
    9, // "Thermidor"
    9, // "Fructidor"
    7, // days: "Primidi"
    5, // "Duodi"
    5, // "Tridi"
    8, // "Quartidi"
    8, // "Quintidi"
    7, // "Sextidi"
    7, // "Septidi"
    6, // "Octidi"
    6, // "Nonidi"
    6, // "Décadi"
    16, // sansculottides: "Fête de la Vertu"
    13, // "Fête du Génie"
    15, // "Fête du Travail"
    17, // "Fête de l'Opinion"
    20, // "Fête des Récompenses"
    21, // "Fête de la Révolution"
    9, // day_of_year: "du raisin"
    9, // "du safran"
    15, // "de la châtaigne"
    12, // "du colchique"
    9, // "du cheval"
    15, // "de la balsamine"
    13, // "de la carotte"
    13, // "de l'amarante"
    9, // "du panais"
    10, // "de la cuve"
    20, // "de la pomme de terre"
    15, // "de l'immortelle"
    10, // "du potiron"
    9, // "du réséda"
    8, // "de l'âne"
    19, // "de la belle de nuit"
    16, // "de la citrouille"
    11, // "du sarrasin"
    12, // "du tournesol"
    11, // "du pressoir"
    10, // "du chanvre"
    11, // "de la pêche"
    8, // "du navet"
    14, // "de l'amaryllis"
    7, // "du bœuf"
    14, // "de l'aubergine"
    9, // "du piment"
    12, // "de la tomate"
    9, // "de l'orge"
    10, // "du tonneau"
    11, // "de la pomme"
    9, // "du céleri"
    11, // "de la poire"
    15, // "de la betterave"
    8, // "de l'oie"
    15, // "de l'héliotrope"
    11, // "de la figue"
    16, // "de la scorsonère"
    12, // "de l'alisier"
    13, // "de la charrue"
    11, // "du salsifis"
    11, // "de la macre"
    14, // "du topinambour"
    11, // "de l'endive"
    9, // "du dindon"
    10, // "du chervis"
    10, // "du cresson"
    16, // "de la dentelaire"
    13, // "de la grenade"
    11, // "de la herse"
    15, // "de la bacchante"
    12, // "de l'azerole"
    13, // "de la garance"
    11, // "de l'orange"
    9, // "du faisan"
    14, // "de la pistache"
    10, // "du macjonc"
    8, // "du coing"
    10, // "du cormier"
    10, // "du rouleau"
    14, // "de la raiponce"
    10, // "du turneps"
    14, // "de la chicorée"
    11, // "de la nèfle"
    9, // "du cochon"
    11, // "de la mâche"
    13, // "du chou-fleur"
    7, // "du miel"
    9, // "du génépi"
    12, // "de la pioche"
    10, // "de la cire"
    10, // "du raifort"
    8, // "du cèdre"
    8, // "du sapin"
    12, // "du chevreuil"
    10, // "de l'ajonc"
    9, // "du cyprès"
    9, // "du lierre"
    12, // "de la sabine"
    10, // "de la hoye"
    17, // "de l'érable sucré"
    13, // "de la bruyère"
    9, // "du roseau"
    12, // "de l'oseille"
    10, // "du grillon"
    9, // "du pignon"
    8, // "du liège"
    12, // "de la truffe"
    10, // "de l'olive"
    11, // "de la pelle"
    12, // "de la tourbe"
    13, // "de la houille"
    9, // "du bitume"
    9, // "du soufre"
    8, // "du chien"
    10, // "de la lave"
    20, // "de la terre végétale"
    9, // "du fumier"
    11, // "du salpêtre"
    8, // "du fléau"
    10, // "du granite"
    11, // "de l'argile"
    12, // "de l'ardoise"
    7, // "du grès"
    8, // "du lapin"
    8, // "du silex"
    11, // "de la marne"
    20, // "de la pierre à chaux"
    9, // "du marbre"
    6, // "du van"
    21, // "de la pierre à plâtre"
    6, // "du sel"
    6, // "du fer"
    9, // "du cuivre"
    7, // "du chat"
    10, // "de l'étain"
    8, // "du plomb"
    7, // "du zinc"
    10, // "du mercure"
    9, // "du crible"
    14, // "de la lauréole"
    12, // "de la mousse"
    9, // "du fragon"
    15, // "de la pervenche"
    10, // "du taureau"
    14, // "du laurier-tin"
    13, // "de l'amatyste"
    11, // "du mézéréon"
    11, // "du peuplier"
    13, // "de la coignée"
    13, // "de l'ellébore"
    10, // "du brocoli"
    10, // "du laurier"
    14, // "de l'avelinier"
    11, // "de la vache"
    7, // "du buis"
    9, // "du lichén"
    7, // "de l'if"
    16, // "de la pulmonaire"
    14, // "de la serpette"
    10, // "du thlaspi"
    10, // "du thimelé"
    12, // "du chiendent"
    15, // "de la traînasse"
    9, // "du lièvre"
    11, // "de la guède"
    12, // "du noisetier"
    11, // "du cyclamen"
    16, // "de la chélidoine"
    11, // "du traîneau"
    12, // "du tussilage"
    14, // "du cornouiller"
    10, // "du violier"
    9, // "du troène"
    7, // "du bouc"
    11, // "de l'asaret"
    13, // "de l'alaterne"
    14, // "de la violette"
    10, // "du marceau"
    11, // "de la bêche"
    11, // "du narcisse"
    9, // "de l'orme"
    15, // "de la fumeterre"
    8, // "du vélar"
    12, // "de la chèvre"
    12, // "de l'épinard"
    10, // "du doronic"
    9, // "du mouron"
    11, // "du cerfeuil"
    10, // "du cordeau"
    16, // "de la mandragore"
    9, // "du persil"
    13, // "du cochléaria"
    16, // "de la pâquerette"
    7, // "du thon"
    12, // "du pissenlit"
    12, // "de la sylvie"
    13, // "du capillaire"
    8, // "du frêne"
    11, // "du plantoir"
    15, // "de la primevère"
    10, // "du platane"
    12, // "de l'asperge"
    12, // "de la tulipe"
    11, // "de la poule"
    11, // "de la bette"
    10, // "du bouleau"
    15, // "de la jonquille"
    10, // "de l'aulne"
    10, // "du couvoir"
    14, // "du perce-neige"
    9, // "du crocus"
    8, // "du hêtre"
    12, // "de la laitue"
    11, // "du torillon"
    8, // "du lilas"
    12, // "de l'anémone"
    12, // "de la pensée"
    14, // "de la myrtille"
    11, // "du greffoir"
    11, // "du cerisier"
    14, // "de la verveine"
    12, // "du grenadier"
    9, // "du vernal"
    9, // "du cheval"
    14, // "de la brenèche"
    9, // "du charme"
    13, // "de la morille"
    17, // "du hêtre enraciné"
    11, // "de la ruche"
    10, // "de la rose"
    8, // "du chêne"
    13, // "de la fougère"
    13, // "de l'aubépine"
    12, // "du rossignol"
    12, // "de l'ancolie"
    9, // "du muguet"
    13, // "du champignon"
    14, // "de l'hyacinthe"
    9, // "du râteau"
    14, // "de la rhubarbe"
    11, // "du sainfoin"
    13, // "du bâton-d'or"
    14, // "du chamerisier"
    13, // "du ver à soie"
    14, // "de la consoude"
    17, // "de la pimprenelle"
    20, // "de la corbeille d'or"
    12, // "de l'arroche"
    11, // "du sarcloir"
    13, // "de la statice"
    17, // "de la fritillaire"
    14, // "de la bourache"
    15, // "de la valériane"
    11, // "de la carpe"
    9, // "du fusain"
    13, // "de la civette"
    14, // "de la buglosse"
    9, // "du sénevé"
    14, // "de la houlette"
    13, // "de la luzerne"
    16, // "de l'hémérocalle"
    9, // "du trèfle"
    14, // "de l'angélique"
    9, // "du canard"
    13, // "de la mélisse"
    12, // "du fromental"
    11, // "du martagon"
    11, // "du serpolet"
    10, // "de la faux"
    12, // "de la fraise"
    13, // "de la bétoine"
    7, // "du pois"
    11, // "de l'acacia"
    12, // "de la caille"
    11, // "de l'œillet"
    9, // "du sureau"
    8, // "du pavot"
    10, // "du tilleul"
    13, // "de la fourche"
    10, // "du barbeau"
    15, // "de la camomille"
    16, // "du chévrefeuille"
    14, // "du caille-lait"
    12, // "de la tanche"
    9, // "du jasmin"
    14, // "de la verveine"
    7, // "du thym"
    13, // "de la pivoine"
    10, // "du chariot"
    9, // "du seigle"
    11, // "de l'avoine"
    11, // "de l'oignon"
    15, // "de la véronique"
    8, // "du mulet"
    13, // "de la romaine"
    12, // "du concombre"
    13, // "de l'échalote"
    13, // "de l'absinthe"
    14, // "de la faucille"
    15, // "de la coriandre"
    14, // "de l'artichaut"
    13, // "de la girofle"
    13, // "de la lavande"
    10, // "du chamois"
    8, // "du tabac"
    15, // "de la groseille"
    11, // "de la gesse"
    12, // "de la cerise"
    7, // "du parc"
    12, // "de la menthe"
    8, // "du cumin"
    10, // "du haricot"
    13, // "de l'orcanète"
    13, // "de la pintade"
    11, // "de la sauge"
    8, // "de l'ail"
    11, // "de la vesce"
    6, // "du blé"
    14, // "de la chalémie"
    13, // "de l'épeautre"
    17, // "du bouillon-blanc"
    8, // "du melon"
    11, // "de l'ivraie"
    9, // "du bélier"
    11, // "de la prêle"
    12, // "de l'armoise"
    11, // "du carthame"
    10, // "de la mûre"
    13, // "de l'arrosoir"
    8, // "du panis"
    15, // "de la salicorne"
    12, // "de l'abricot"
    10, // "du basilic"
    12, // "de la brebis"
    14, // "de la guimauve"
    6, // "du lin"
    11, // "de l'amande"
    14, // "de la gentiane"
    11, // "de l'écluse"
    13, // "de la carline"
    10, // "du câprier"
    14, // "de la lentille"
    10, // "de l'aunée"
    12, // "de la loutre"
    8, // "du myrte"
    8, // "du colza"
    8, // "du lupin"
    8, // "du coton"
    9, // "du moulin"
    11, // "de la prune"
    9, // "du millet"
    13, // "du lycoperdon"
    15, // "de l'escourgeon"
    9, // "du saumon"
    15, // "de la tubéreuse"
    10, // "du sucrion"
    11, // "de l'apocyn"
    14, // "de la réglisse"
    12, // "de l'échelle"
    14, // "de la pastèque"
    10, // "du fenouil"
    18, // "de l'épine-vinette"
    10, // "de la noix"
    12, // "de la truite"
    9, // "du citron"
    13, // "de la cardère"
    10, // "du nerprun"
    13, // "de la tagette"
    11, // "de la hotte"
    14, // "de l'églantier"
    14, // "de la noisette"
    10, // "du houblon"
    9, // "du sorgho"
    14, // "de l'écrevisse"
    14, // "de la bigarade"
    16, // "de la verge d'or"
    7, // "du maïs"
    9, // "du marron"
    9, // "du panier"
};

// big font character widths
const std::array<uint8_t, big_font_len> big_font_char_widths = {
    19, // '0'
    14, // '1'
    19, // '2'
    19, // '3'
    20, // '4'
    18, // '5'
    19, // '6'
    19, // '7'
    19, // '8'
    19, // '9'
    7, // ':'
};

// big font character begin positions
const std::array<uint16_t, big_font_len> big_font_char_begin = {
    0, // '0'
    117, // '1'
    195, // '2'
    312, // '3'
    429, // '4'
    546, // '5'
    663, // '6'
    780, // '7'
    897, // '8'
    1014, // '9'
    1131, // ':'
};

// big font content (bitmap data, packed)
const std::array<uint8_t, 1170> big_font_content = {
    // '0'
    //                    
    //                    
    //                    
    //                    
    //                    
    //                    
    //        #####       
    //     #########      
    //     #########      
    //     ##########     
    //    #####   ####    
    //    ####    ####    
    //   #####     ###    
    //   #####     #####  
    //   ###       #####  
    //   ###       #####  
    //   ###       #####  
    //  ####        ####  
    //  ####        ####  
    //  ####        ####  
    //  ####        ####  
    //  ####        ####  
    //  ####        ####  
    //  ####       #####  
    //   ###       #####  
    //   ###       #####  
    //   ###       #####  
    //   #####     #####  
    //   #####     ###    
    //   #####    ####    
    //    #####   ####    
    //    #####   ####    
    //    ###########     
    //     #########      
    //        #####       
    //                    
    //                    
    //                    
    //                    
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x01,
    0xF0,
    0x00,
    0x0F,
    0xF8,
    0x00,
    0x0F,
    0xF8,
    0x00,
    0x0F,
    0xFC,
    0x00,
    0x1F,
    0x1E,
    0x00,
    0x1E,
    0x1E,
    0x00,
    0x3E,
    0x0E,
    0x00,
    0x3E,
    0x0F,
    0x80,
    0x38,
    0x0F,
    0x80,
    0x38,
    0x0F,
    0x80,
    0x38,
    0x0F,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x0F,
    0x80,
    0x38,
    0x0F,
    0x80,
    0x38,
    0x0F,
    0x80,
    0x38,
    0x0F,
    0x80,
    0x3E,
    0x0F,
    0x80,
    0x3E,
    0x0E,
    0x00,
    0x3E,
    0x1E,
    0x00,
    0x1F,
    0x1E,
    0x00,
    0x1F,
    0x1E,
    0x00,
    0x1F,
    0xFC,
    0x00,
    0x0F,
    0xF8,
    0x00,
    0x01,
    0xF0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '1'
    //               
    //               
    //               
    //               
    //               
    //               
    //         ####  
    //        #####  
    //        #####  
    //       ######  
    //     ########  
    //    #########  
    //   ##### ####  
    //  #####  ####  
    //   ##    ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //         ####  
    //               
    //               
    //               
    //               
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xF0,
    0x01,
    0xF0,
    0x01,
    0xF0,
    0x03,
    0xF0,
    0x0F,
    0xF0,
    0x1F,
    0xF0,
    0x3E,
    0xF0,
    0x7C,
    0xF0,
    0x30,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0xF0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '2'
    //                    
    //                    
    //                    
    //                    
    //                    
    //                    
    //      #######       
    //    ##########      
    //    ##########      
    //  #############     
    //   #####   #####    
    //    #       ####    
    //             ###    
    //             ###    
    //             ###    
    //             ###    
    //            ####    
    //            ####    
    //            ####    
    //           ####     
    //           ####     
    //          ####      
    //          ####      
    //         ####       
    //        ####        
    //        ####        
    //      #####         
    //     #####          
    //    ######          
    //    #####           
    //   #####            
    //   #####            
    //  ################  
    //  ################  
    //  ################  
    //                    
    //                    
    //                    
    //                    
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x07,
    0xF0,
    0x00,
    0x1F,
    0xF8,
    0x00,
    0x1F,
    0xF8,
    0x00,
    0x7F,
    0xFC,
    0x00,
    0x3E,
    0x3E,
    0x00,
    0x10,
    0x1E,
    0x00,
    0x00,
    0x0E,
    0x00,
    0x00,
    0x0E,
    0x00,
    0x00,
    0x0E,
    0x00,
    0x00,
    0x0E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x78,
    0x00,
    0x00,
    0x78,
    0x00,
    0x00,
    0xF0,
    0x00,
    0x01,
    0xE0,
    0x00,
    0x01,
    0xE0,
    0x00,
    0x07,
    0xC0,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x1F,
    0x80,
    0x00,
    0x1F,
    0x00,
    0x00,
    0x3E,
    0x00,
    0x00,
    0x3E,
    0x00,
    0x00,
    0x7F,
    0xFF,
    0x80,
    0x7F,
    0xFF,
    0x80,
    0x7F,
    0xFF,
    0x80,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '3'
    //                    
    //                    
    //                    
    //                    
    //                    
    //                    
    //      #######       
    //    ###########     
    //    ###########     
    //  #############     
    //   ###     #####    
    //    #       ####    
    //             ###    
    //             #####  
    //             ###    
    //            ####    
    //            ####    
    //          #####     
    //     #########      
    //     ########       
    //     ########       
    //     ##########     
    //           #####    
    //            ####    
    //             #####  
    //             #####  
    //             #####  
    //             #####  
    //             #####  
    //  #         ######  
    //  ###      #####    
    //  ###      #####    
    //  #############     
    //  ############      
    //    ########        
    //                    
    //                    
    //                    
    //                    
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x07,
    0xF0,
    0x00,
    0x1F,
    0xFC,
    0x00,
    0x1F,
    0xFC,
    0x00,
    0x7F,
    0xFC,
    0x00,
    0x38,
    0x3E,
    0x00,
    0x10,
    0x1E,
    0x00,
    0x00,
    0x0E,
    0x00,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x7C,
    0x00,
    0x0F,
    0xF8,
    0x00,
    0x0F,
    0xF0,
    0x00,
    0x0F,
    0xF0,
    0x00,
    0x0F,
    0xFC,
    0x00,
    0x00,
    0x3E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x40,
    0x1F,
    0x80,
    0x70,
    0x3E,
    0x00,
    0x70,
    0x3E,
    0x00,
    0x7F,
    0xFC,
    0x00,
    0x7F,
    0xF8,
    0x00,
    0x1F,
    0xE0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '4'
    //                     
    //                     
    //                     
    //                     
    //                     
    //                     
    //           ####      
    //           ####      
    //           ####      
    //          #####      
    //          #####      
    //         ######      
    //         ## ###      
    //        ### ###      
    //        ### ###      
    //      ####  ###      
    //      ####  ###      
    //     ####   ###      
    //     ####   ###      
    //    ####    ###      
    //    ####    ###      
    //    ####    ###      
    //   ###      ###      
    //  ####      ###      
    //  ###       ###      
    //  #################  
    //  #################  
    //  #################  
    //            ###      
    //            ###      
    //            ###      
    //            ###      
    //            ###      
    //            ###      
    //            ###      
    //                     
    //                     
    //                     
    //                     
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x7C,
    0x00,
    0x00,
    0x7C,
    0x00,
    0x00,
    0xFC,
    0x00,
    0x00,
    0xDC,
    0x00,
    0x01,
    0xDC,
    0x00,
    0x01,
    0xDC,
    0x00,
    0x07,
    0x9C,
    0x00,
    0x07,
    0x9C,
    0x00,
    0x0F,
    0x1C,
    0x00,
    0x0F,
    0x1C,
    0x00,
    0x1E,
    0x1C,
    0x00,
    0x1E,
    0x1C,
    0x00,
    0x1E,
    0x1C,
    0x00,
    0x38,
    0x1C,
    0x00,
    0x78,
    0x1C,
    0x00,
    0x70,
    0x1C,
    0x00,
    0x7F,
    0xFF,
    0xC0,
    0x7F,
    0xFF,
    0xC0,
    0x7F,
    0xFF,
    0xC0,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '5'
    //                   
    //                   
    //                   
    //                   
    //                   
    //                   
    //   ############    
    //   ############    
    //   ############    
    //   ############    
    //   ####            
    //   ####            
    //   ####            
    //  #####            
    //  #####            
    //  #####            
    //  #####            
    //  ##########       
    //  ############     
    //  #############    
    //  #############    
    //   #      #####    
    //           ######  
    //            #####  
    //            #####  
    //            #####  
    //            #####  
    //            #####  
    //            #####  
    //  #        ####    
    //  ##      #####    
    //  ##      #####    
    //  ############     
    //  ###########      
    //   ########        
    //                   
    //                   
    //                   
    //                   
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x3F,
    0xFC,
    0x00,
    0x3F,
    0xFC,
    0x00,
    0x3F,
    0xFC,
    0x00,
    0x3F,
    0xFC,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x7C,
    0x00,
    0x00,
    0x7C,
    0x00,
    0x00,
    0x7C,
    0x00,
    0x00,
    0x7C,
    0x00,
    0x00,
    0x7F,
    0xE0,
    0x00,
    0x7F,
    0xF8,
    0x00,
    0x7F,
    0xFC,
    0x00,
    0x7F,
    0xFC,
    0x00,
    0x20,
    0x7C,
    0x00,
    0x00,
    0x3F,
    0x00,
    0x00,
    0x1F,
    0x00,
    0x00,
    0x1F,
    0x00,
    0x00,
    0x1F,
    0x00,
    0x00,
    0x1F,
    0x00,
    0x00,
    0x1F,
    0x00,
    0x00,
    0x1F,
    0x00,
    0x40,
    0x3C,
    0x00,
    0x60,
    0x7C,
    0x00,
    0x60,
    0x7C,
    0x00,
    0x7F,
    0xF8,
    0x00,
    0x7F,
    0xF0,
    0x00,
    0x3F,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '6'
    //                    
    //                    
    //                    
    //                    
    //                    
    //                    
    //          ######    
    //        ########    
    //        ########    
    //      ##########    
    //     ######         
    //    #####           
    //    ####            
    //    ####            
    //   #####            
    //   ###              
    //   ###   #####      
    //   ###  #######     
    //   #############    
    //   ######   ####    
    //   ######   ####    
    //  ######     #####  
    //  ######     #####  
    //  ####        ####  
    //  ####        ####  
    //   ###        ####  
    //   ###        ####  
    //   #####     #####  
    //   #####     #####  
    //    ####     #####  
    //    #####   ####    
    //    #####   ####    
    //     ###########    
    //      #########     
    //        #####       
    //                    
    //                    
    //                    
    //                    
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x7E,
    0x00,
    0x01,
    0xFE,
    0x00,
    0x01,
    0xFE,
    0x00,
    0x07,
    0xFE,
    0x00,
    0x0F,
    0xC0,
    0x00,
    0x1F,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x3E,
    0x00,
    0x00,
    0x38,
    0x00,
    0x00,
    0x38,
    0xF8,
    0x00,
    0x39,
    0xFC,
    0x00,
    0x3F,
    0xFE,
    0x00,
    0x3F,
    0x1E,
    0x00,
    0x3F,
    0x1E,
    0x00,
    0x7E,
    0x0F,
    0x80,
    0x7E,
    0x0F,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x38,
    0x07,
    0x80,
    0x38,
    0x07,
    0x80,
    0x3E,
    0x0F,
    0x80,
    0x3E,
    0x0F,
    0x80,
    0x1E,
    0x0F,
    0x80,
    0x1F,
    0x1E,
    0x00,
    0x1F,
    0x1E,
    0x00,
    0x0F,
    0xFE,
    0x00,
    0x07,
    0xFC,
    0x00,
    0x01,
    0xF0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '7'
    //                    
    //                    
    //                    
    //                    
    //                    
    //                    
    //  ################  
    //  ################  
    //  ################  
    //  ################  
    //             #####  
    //             #####  
    //             ###    
    //            ####    
    //            ####    
    //            ###     
    //           ####     
    //           ####     
    //           ###      
    //          ####      
    //          ####      
    //          ####      
    //          ###       
    //         ####       
    //         ####       
    //        ####        
    //        ####        
    //        ####        
    //      #####         
    //      #####         
    //      #####         
    //      #####         
    //     #####          
    //     #####          
    //    ######          
    //                    
    //                    
    //                    
    //                    
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x7F,
    0xFF,
    0x80,
    0x7F,
    0xFF,
    0x80,
    0x7F,
    0xFF,
    0x80,
    0x7F,
    0xFF,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x00,
    0x38,
    0x00,
    0x00,
    0x78,
    0x00,
    0x00,
    0x78,
    0x00,
    0x00,
    0x78,
    0x00,
    0x00,
    0x70,
    0x00,
    0x00,
    0xF0,
    0x00,
    0x00,
    0xF0,
    0x00,
    0x01,
    0xE0,
    0x00,
    0x01,
    0xE0,
    0x00,
    0x01,
    0xE0,
    0x00,
    0x07,
    0xC0,
    0x00,
    0x07,
    0xC0,
    0x00,
    0x07,
    0xC0,
    0x00,
    0x07,
    0xC0,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x1F,
    0x80,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '8'
    //                    
    //                    
    //                    
    //                    
    //                    
    //                    
    //      #######       
    //     ##########     
    //     ##########     
    //    ############    
    //   ######   ####    
    //   #####     #####  
    //   #####     #####  
    //   ###       #####  
    //   #####     #####  
    //   #####     ###    
    //    #####   ####    
    //    ###### ####     
    //     #########      
    //      #######       
    //      #######       
    //     #########      
    //    #####  ####     
    //   #####    ####    
    //   ###       #####  
    //  ####        ####  
    //  ####        ####  
    //  ####        ####  
    //  ####        ####  
    //   ###       #####  
    //   #####    ######  
    //   #####    ######  
    //   #############    
    //    ###########     
    //      #######       
    //                    
    //                    
    //                    
    //                    
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x07,
    0xF0,
    0x00,
    0x0F,
    0xFC,
    0x00,
    0x0F,
    0xFC,
    0x00,
    0x1F,
    0xFE,
    0x00,
    0x3F,
    0x1E,
    0x00,
    0x3E,
    0x0F,
    0x80,
    0x3E,
    0x0F,
    0x80,
    0x38,
    0x0F,
    0x80,
    0x3E,
    0x0F,
    0x80,
    0x3E,
    0x0E,
    0x00,
    0x1F,
    0x1E,
    0x00,
    0x1F,
    0xBC,
    0x00,
    0x0F,
    0xF8,
    0x00,
    0x07,
    0xF0,
    0x00,
    0x07,
    0xF0,
    0x00,
    0x0F,
    0xF8,
    0x00,
    0x1F,
    0x3C,
    0x00,
    0x3E,
    0x1E,
    0x00,
    0x38,
    0x0F,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x78,
    0x07,
    0x80,
    0x38,
    0x0F,
    0x80,
    0x3E,
    0x1F,
    0x80,
    0x3E,
    0x1F,
    0x80,
    0x3F,
    0xFE,
    0x00,
    0x1F,
    0xFC,
    0x00,
    0x07,
    0xF0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '9'
    //                    
    //                    
    //                    
    //                    
    //                    
    //                    
    //      #######       
    //     #########      
    //     #########      
    //    ###########     
    //   ######   ####    
    //   #####    ####    
    //   ###       ###    
    //  ####       #####  
    //  ####       #####  
    //  ####       #####  
    //  ####       #####  
    //  ####       #####  
    //   #####     #####  
    //   #####    ######  
    //   #####    ######  
    //    ######### ####  
    //    ######### ####  
    //      #####  #####  
    //             #####  
    //             #####  
    //             ###    
    //            ####    
    //            ####    
    //           ####     
    //   #      #####     
    //   #      #####     
    //    ##########      
    //    #########       
    //    #######         
    //                    
    //                    
    //                    
    //                    
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x07,
    0xF0,
    0x00,
    0x0F,
    0xF8,
    0x00,
    0x0F,
    0xF8,
    0x00,
    0x1F,
    0xFC,
    0x00,
    0x3F,
    0x1E,
    0x00,
    0x3E,
    0x1E,
    0x00,
    0x38,
    0x0E,
    0x00,
    0x78,
    0x0F,
    0x80,
    0x78,
    0x0F,
    0x80,
    0x78,
    0x0F,
    0x80,
    0x78,
    0x0F,
    0x80,
    0x78,
    0x0F,
    0x80,
    0x3E,
    0x0F,
    0x80,
    0x3E,
    0x1F,
    0x80,
    0x3E,
    0x1F,
    0x80,
    0x1F,
    0xF7,
    0x80,
    0x1F,
    0xF7,
    0x80,
    0x07,
    0xCF,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0F,
    0x80,
    0x00,
    0x0E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x1E,
    0x00,
    0x00,
    0x3C,
    0x00,
    0x20,
    0x7C,
    0x00,
    0x20,
    0x7C,
    0x00,
    0x1F,
    0xF8,
    0x00,
    0x1F,
    0xF0,
    0x00,
    0x1F,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // ':'
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //  ####  
    // #####  
    // ###### 
    // #####  
    //  ####  
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //  ####  
    // #####  
    // #####  
    // ###### 
    // #####  
    //  ####  
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0xF8,
    0xFC,
    0xF8,
    0x78,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0xF8,
    0xF8,
    0xFC,
    0xF8,
    0x78,
    0x00,
    0x00,
    0x00,
    0x00
};

// normal font character widths
const std::array<uint8_t, normal_font_len> normal_font_char_widths = {
    8, // '0'
    6, // '1'
    8, // '2'
    8, // '3'
    9, // '4'
    8, // '5'
    8, // '6'
    8, // '7'
    8, // '8'
    8, // '9'
    3, // ':'
    5, // ' '
    3, // '''
    6, // '-'
    10, // 'A'
    9, // 'B'
    9, // 'D'
    7, // 'F'
    9, // 'G'
    3, // 'J'
    12, // 'M'
    10, // 'N'
    10, // 'O'
    8, // 'P'
    10, // 'Q'
    9, // 'R'
    7, // 'S'
    9, // 'T'
    10, // 'V'
    7, // 'a'
    8, // 'b'
    7, // 'c'
    8, // 'd'
    8, // 'e'
    7, // 'f'
    8, // 'g'
    8, // 'h'
    3, // 'i'
    4, // 'j'
    3, // 'l'
    12, // 'm'
    8, // 'n'
    8, // 'o'
    8, // 'p'
    8, // 'q'
    6, // 'r'
    6, // 's'
    6, // 't'
    8, // 'u'
    9, // 'v'
    8, // 'x'
    9, // 'y'
    7, // 'z'
    7, // 'à'
    7, // 'â'
    8, // 'è'
    8, // 'é'
    8, // 'ê'
    6, // 'î'
    4, // 'ï'
    8, // 'ô'
    8, // 'û'
    13, // 'œ'
    10, // '🔔' (custom bell bitmap)
};

// normal font character begin positions
const std::array<uint16_t, normal_font_len> normal_font_char_begin = {
    0, // '0'
    24, // '1'
    48, // '2'
    72, // '3'
    96, // '4'
    144, // '5'
    168, // '6'
    192, // '7'
    216, // '8'
    240, // '9'
    264, // ':'
    288, // ' '
    312, // '''
    336, // '-'
    360, // 'A'
    408, // 'B'
    456, // 'D'
    504, // 'F'
    528, // 'G'
    576, // 'J'
    600, // 'M'
    648, // 'N'
    696, // 'O'
    744, // 'P'
    768, // 'Q'
    816, // 'R'
    864, // 'S'
    888, // 'T'
    936, // 'V'
    984, // 'a'
    1008, // 'b'
    1032, // 'c'
    1056, // 'd'
    1080, // 'e'
    1104, // 'f'
    1128, // 'g'
    1152, // 'h'
    1176, // 'i'
    1200, // 'j'
    1224, // 'l'
    1248, // 'm'
    1296, // 'n'
    1320, // 'o'
    1344, // 'p'
    1368, // 'q'
    1392, // 'r'
    1416, // 's'
    1440, // 't'
    1464, // 'u'
    1488, // 'v'
    1536, // 'x'
    1560, // 'y'
    1608, // 'z'
    1632, // 'à'
    1656, // 'â'
    1680, // 'è'
    1704, // 'é'
    1728, // 'ê'
    1752, // 'î'
    1776, // 'ï'
    1800, // 'ô'
    1824, // 'û'
    1848, // 'œ'
    1896, // '🔔' (custom bell bitmap)
};

// normal font content (bitmap data, packed)
const std::array<uint8_t, 1944> normal_font_content = {
    // '0'
    //         
    //         
    //         
    //         
    //  ####   
    //  #####  
    // ##  ##  
    // ##   #  
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   #  
    // ##  ##  
    //  #####  
    //  ####   
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0x7C,
    0xCC,
    0xC4,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC4,
    0xCC,
    0x7C,
    0x78,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '1'
    //       
    //       
    //       
    //       
    //    ## 
    //   ### 
    //  #### 
    // ## ## 
    //    ## 
    //    ## 
    //    ## 
    //    ## 
    //    ## 
    //    ## 
    //    ## 
    //    ## 
    //    ## 
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    0x00,
    0x00,
    0x00,
    0x00,
    0x18,
    0x38,
    0x78,
    0xD8,
    0x18,
    0x18,
    0x18,
    0x18,
    0x18,
    0x18,
    0x18,
    0x18,
    0x18,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '2'
    //         
    //         
    //         
    //         
    //  ####   
    // ######  
    // #   ##  
    //     ##  
    //     ##  
    //     ##  
    //    ##   
    //    ##   
    //   ##    
    //  ##     
    //  ##     
    // ####### 
    // ####### 
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0xFC,
    0x8C,
    0x0C,
    0x0C,
    0x0C,
    0x18,
    0x18,
    0x30,
    0x60,
    0x60,
    0xFE,
    0xFE,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '3'
    //         
    //         
    //         
    //         
    //  ####   
    // ######  
    // #   ##  
    //     ##  
    //     ##  
    //  ####   
    //  ####   
    //     ##  
    //      #  
    //      ## 
    //     ##  
    // ######  
    // #####   
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0xFC,
    0x8C,
    0x0C,
    0x0C,
    0x78,
    0x78,
    0x0C,
    0x04,
    0x06,
    0x0C,
    0xFC,
    0xF8,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '4'
    //          
    //          
    //          
    //          
    //      ##  
    //     ###  
    //     ###  
    //    # ##  
    //   ## ##  
    //   #  ##  
    //  ##  ##  
    //  #   ##  
    // ######## 
    // ######## 
    //      ##  
    //      ##  
    //      ##  
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x06,
    0x00,
    0x0E,
    0x00,
    0x0E,
    0x00,
    0x16,
    0x00,
    0x36,
    0x00,
    0x26,
    0x00,
    0x66,
    0x00,
    0x46,
    0x00,
    0xFF,
    0x00,
    0xFF,
    0x00,
    0x06,
    0x00,
    0x06,
    0x00,
    0x06,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '5'
    //         
    //         
    //         
    //         
    // ######  
    // ######  
    // ##      
    // ##      
    // ##      
    // #####   
    // ######  
    //     ##  
    //      ## 
    //      ## 
    //     ##  
    // ######  
    // #####   
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0xFC,
    0xFC,
    0xC0,
    0xC0,
    0xC0,
    0xF8,
    0xFC,
    0x0C,
    0x06,
    0x06,
    0x0C,
    0xFC,
    0xF8,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '6'
    //         
    //         
    //         
    //         
    //   ####  
    //  #####  
    //  #      
    // ##      
    // ## #    
    // ######  
    // ##  ##  
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   #  
    //  #####  
    //   ###   
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x3C,
    0x7C,
    0x40,
    0xC0,
    0xD0,
    0xFC,
    0xCC,
    0xC6,
    0xC6,
    0xC6,
    0xC4,
    0x7C,
    0x38,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '7'
    //         
    //         
    //         
    //         
    // ####### 
    // ####### 
    //     ##  
    //     ##  
    //     ##  
    //    ##   
    //    ##   
    //    ##   
    //   ##    
    //   ##    
    //   ##    
    //  ##     
    //  ##     
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0xFE,
    0xFE,
    0x0C,
    0x0C,
    0x0C,
    0x18,
    0x18,
    0x18,
    0x30,
    0x30,
    0x30,
    0x60,
    0x60,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '8'
    //         
    //         
    //         
    //         
    //  ####   
    // ######  
    // ##   #  
    // ##   #  
    // ##  ##  
    //  ####   
    //  ####   
    // ##  ##  
    // ##   ## 
    // #    ## 
    // ##   ## 
    // ######  
    //  ####   
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0xFC,
    0xC4,
    0xC4,
    0xCC,
    0x78,
    0x78,
    0xCC,
    0xC6,
    0x86,
    0xC6,
    0xFC,
    0x78,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '9'
    //         
    //         
    //         
    //         
    //  ####   
    // ######  
    // ##  ##  
    // ##   #  
    // #    ## 
    // ##  ### 
    // ####### 
    //  ### #  
    //      #  
    //     ##  
    //     ##  
    // #####   
    // ####    
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0xFC,
    0xCC,
    0xC4,
    0x86,
    0xCE,
    0xFE,
    0x74,
    0x04,
    0x0C,
    0x0C,
    0xF8,
    0xF0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // ':'
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    // ## 
    // ## 
    // ## 
    //    
    //    
    //    
    //    
    // ## 
    // ## 
    // ## 
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // ' '
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '''
    //    
    //    
    //    
    //    
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    0x00,
    0x00,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '-'
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    // ##### 
    // ##### 
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xF8,
    0xF8,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'A'
    //           
    //           
    //           
    //           
    //    ###    
    //    ###    
    //    # #    
    //    # ##   
    //   ## ##   
    //   ## ##   
    //   #   #   
    //  #######  
    //  #######  
    //  ##   ##  
    //  ##    ## 
    // ##     ## 
    // ##     ## 
    //           
    //           
    //           
    //           
    //           
    //           
    //           
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x1C,
    0x00,
    0x1C,
    0x00,
    0x14,
    0x00,
    0x16,
    0x00,
    0x36,
    0x00,
    0x36,
    0x00,
    0x22,
    0x00,
    0x7F,
    0x00,
    0x7F,
    0x00,
    0x63,
    0x00,
    0x61,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'B'
    //          
    //          
    //          
    //          
    // ######   
    // #######  
    // ##   ##  
    // ##   ##  
    // ##   ##  
    // #######  
    // ######   
    // ##   ##  
    // ##    ## 
    // ##    ## 
    // ##   ##  
    // #######  
    // ######   
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xFC,
    0x00,
    0xFE,
    0x00,
    0xC6,
    0x00,
    0xC6,
    0x00,
    0xC6,
    0x00,
    0xFE,
    0x00,
    0xFC,
    0x00,
    0xC6,
    0x00,
    0xC3,
    0x00,
    0xC3,
    0x00,
    0xC6,
    0x00,
    0xFE,
    0x00,
    0xFC,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'D'
    //          
    //          
    //          
    //          
    // ######   
    // #######  
    // ##   ### 
    // ##    ## 
    // ##    ## 
    // ##    ## 
    // ##    ## 
    // ##    ## 
    // ##    ## 
    // ##    ## 
    // ##   ### 
    // #######  
    // ######   
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xFC,
    0x00,
    0xFE,
    0x00,
    0xC7,
    0x00,
    0xC3,
    0x00,
    0xC3,
    0x00,
    0xC3,
    0x00,
    0xC3,
    0x00,
    0xC3,
    0x00,
    0xC3,
    0x00,
    0xC3,
    0x00,
    0xC7,
    0x00,
    0xFE,
    0x00,
    0xFC,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'F'
    //        
    //        
    //        
    //        
    // ###### 
    // ###### 
    // ##     
    // ##     
    // ##     
    // ##     
    // ###### 
    // ###### 
    // ##     
    // ##     
    // ##     
    // ##     
    // ##     
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x00,
    0xFC,
    0xFC,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xFC,
    0xFC,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'G'
    //          
    //          
    //          
    //          
    //    ##### 
    //  ####### 
    //  ##      
    // ##       
    // ##       
    // ##       
    // ##   ### 
    // ##   ### 
    // ##     # 
    // ##     # 
    //  ##    # 
    //  ####### 
    //    ##### 
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x1F,
    0x00,
    0x7F,
    0x00,
    0x60,
    0x00,
    0xC0,
    0x00,
    0xC0,
    0x00,
    0xC0,
    0x00,
    0xC7,
    0x00,
    0xC7,
    0x00,
    0xC1,
    0x00,
    0xC1,
    0x00,
    0x61,
    0x00,
    0x7F,
    0x00,
    0x1F,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'J'
    //    
    //    
    //    
    //    
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    //    
    //    
    //    
    //    
    0x00,
    0x00,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'M'
    //             
    //             
    //             
    //             
    // ###      ## 
    // ###     ### 
    // ####    ### 
    // ####    # # 
    // ## #    # # 
    // ## #   ## # 
    // ## ##  #  # 
    // ## ##  #  # 
    // ##  # ##  # 
    // ##  ####  # 
    // ##  ###   # 
    // ##   ##   # 
    // ##   ##   # 
    //             
    //             
    //             
    //             
    //             
    //             
    //             
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xE0,
    0x60,
    0xE0,
    0xE0,
    0xF0,
    0xE0,
    0xF0,
    0xA0,
    0xD0,
    0xA0,
    0xD1,
    0xA0,
    0xD9,
    0x20,
    0xD9,
    0x20,
    0xCB,
    0x20,
    0xCF,
    0x20,
    0xCE,
    0x20,
    0xC6,
    0x20,
    0xC6,
    0x20,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'N'
    //           
    //           
    //           
    //           
    // ###    ## 
    // ###    ## 
    // ####   ## 
    // ####   ## 
    // ## ##  ## 
    // ## ##  ## 
    // ##  ## ## 
    // ##  ## ## 
    // ##   # ## 
    // ##   #### 
    // ##   #### 
    // ##    ### 
    // ##    ### 
    //           
    //           
    //           
    //           
    //           
    //           
    //           
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xE1,
    0x80,
    0xE1,
    0x80,
    0xF1,
    0x80,
    0xF1,
    0x80,
    0xD9,
    0x80,
    0xD9,
    0x80,
    0xCD,
    0x80,
    0xCD,
    0x80,
    0xC5,
    0x80,
    0xC7,
    0x80,
    0xC7,
    0x80,
    0xC3,
    0x80,
    0xC3,
    0x80,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'O'
    //           
    //           
    //           
    //           
    //   #####   
    //  #######  
    //  ##   ##  
    // ##     ## 
    // ##     ## 
    // ##     ## 
    // ##     ## 
    // ##     ## 
    // ##     ## 
    // ##     ## 
    //  ##   ##  
    //  #######  
    //   #####   
    //           
    //           
    //           
    //           
    //           
    //           
    //           
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x3E,
    0x00,
    0x7F,
    0x00,
    0x63,
    0x00,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0x63,
    0x00,
    0x7F,
    0x00,
    0x3E,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'P'
    //         
    //         
    //         
    //         
    // ######  
    // ####### 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ######  
    // #####   
    // ##      
    // ##      
    // ##      
    // ##      
    // ##      
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0xFC,
    0xFE,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xFC,
    0xF8,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'Q'
    //           
    //           
    //           
    //           
    //   #####   
    //  #######  
    //  ##   ##  
    // ##     ## 
    // ##     ## 
    // ##     ## 
    // ##     ## 
    // ##     ## 
    // ##     ## 
    // ##     ## 
    //  ##   ##  
    //  #######  
    //   #####   
    //      ##   
    //       ##  
    //       ### 
    //           
    //           
    //           
    //           
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x3E,
    0x00,
    0x7F,
    0x00,
    0x63,
    0x00,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0xC1,
    0x80,
    0x63,
    0x00,
    0x7F,
    0x00,
    0x3E,
    0x00,
    0x06,
    0x00,
    0x03,
    0x00,
    0x03,
    0x80,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'R'
    //          
    //          
    //          
    //          
    // ######   
    // #######  
    // ##   ##  
    // ##   ##  
    // ##   ##  
    // ##   ##  
    // ######   
    // #####    
    // ##  ##   
    // ##  ##   
    // ##   ##  
    // ##   ##  
    // ##    ## 
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xFC,
    0x00,
    0xFE,
    0x00,
    0xC6,
    0x00,
    0xC6,
    0x00,
    0xC6,
    0x00,
    0xC6,
    0x00,
    0xFC,
    0x00,
    0xF8,
    0x00,
    0xCC,
    0x00,
    0xCC,
    0x00,
    0xC6,
    0x00,
    0xC6,
    0x00,
    0xC3,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'S'
    //        
    //        
    //        
    //        
    //  ##### 
    // ###### 
    // ##     
    // ##     
    // ##     
    // ###    
    //  ####  
    //    ### 
    //     ## 
    //     ## 
    //     ## 
    // ###### 
    // #####  
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x00,
    0x7C,
    0xFC,
    0xC0,
    0xC0,
    0xC0,
    0xE0,
    0x78,
    0x1C,
    0x0C,
    0x0C,
    0x0C,
    0xFC,
    0xF8,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'T'
    //          
    //          
    //          
    //          
    // ######## 
    // ######## 
    //    ##    
    //    ##    
    //    ##    
    //    ##    
    //    ##    
    //    ##    
    //    ##    
    //    ##    
    //    ##    
    //    ##    
    //    ##    
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xFF,
    0x00,
    0xFF,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'V'
    //           
    //           
    //           
    //           
    // ##     ## 
    // ##     #  
    //  ##   ##  
    //  ##   ##  
    //  ##   ##  
    //  ##   #   
    //   #  ##   
    //   ## ##   
    //   ## ##   
    //   ## #    
    //    ###    
    //    ###    
    //    ###    
    //           
    //           
    //           
    //           
    //           
    //           
    //           
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xC1,
    0x80,
    0xC1,
    0x00,
    0x63,
    0x00,
    0x63,
    0x00,
    0x63,
    0x00,
    0x62,
    0x00,
    0x26,
    0x00,
    0x36,
    0x00,
    0x36,
    0x00,
    0x34,
    0x00,
    0x1C,
    0x00,
    0x1C,
    0x00,
    0x1C,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'a'
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    // #####  
    //  ##### 
    //     ## 
    //     ## 
    //  ##### 
    // ###### 
    // ##  ## 
    // #   ## 
    // #### # 
    //  ### # 
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xF8,
    0x7C,
    0x0C,
    0x0C,
    0x7C,
    0xFC,
    0xCC,
    0x8C,
    0xF4,
    0x74,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'b'
    //         
    //         
    //         
    // ##      
    // ##      
    // ##      
    // ##      
    // ## ###  
    // ####### 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ####### 
    // ## ###  
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xDC,
    0xFE,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xFE,
    0xDC,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'c'
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //   #### 
    //  ####  
    // ##     
    // ##     
    // ##     
    // ##     
    // ##     
    // ##     
    // #####  
    //  ####  
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x3C,
    0x78,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xF8,
    0x78,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'd'
    //         
    //         
    //         
    //      ## 
    //      ## 
    //      ## 
    //      ## 
    //  ### ## 
    // ####### 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ####### 
    //  ### ## 
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x06,
    0x06,
    0x06,
    0x06,
    0x76,
    0xFE,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xFE,
    0x76,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'e'
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    //  ####   
    //  #####  
    // ##   #  
    // ##   #  
    // ####### 
    // ####### 
    // ##      
    // ##      
    //  #####  
    //   ####  
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0x7C,
    0xC4,
    0xC4,
    0xFE,
    0xFE,
    0xC0,
    0xC0,
    0x7C,
    0x3C,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'f'
    //        
    //        
    //        
    //   #### 
    //   ###  
    //  ##    
    //  ##    
    // #####  
    // #####  
    //  ##    
    //  ##    
    //  ##    
    //  ##    
    //  ##    
    //  ##    
    //  ##    
    //  ##    
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x3C,
    0x38,
    0x60,
    0x60,
    0xF8,
    0xF8,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'g'
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    //  ### ## 
    // ####### 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ####### 
    //  ### ## 
    //      ## 
    //      ## 
    // ######  
    // #####   
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x76,
    0xFE,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xFE,
    0x76,
    0x06,
    0x06,
    0xFC,
    0xF8,
    0x00,
    0x00,
    0x00,

    // 'h'
    //         
    //         
    //         
    // ##      
    // ##      
    // ##      
    // ##      
    // ## ###  
    // ####### 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xDC,
    0xFE,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'i'
    //    
    //    
    //    
    // ## 
    // ## 
    //    
    //    
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    0x00,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'j'
    //     
    //     
    //     
    //  ## 
    //  ## 
    //     
    //     
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    //  ## 
    // ### 
    // ##  
    //     
    //     
    //     
    0x00,
    0x00,
    0x00,
    0x60,
    0x60,
    0x00,
    0x00,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0xE0,
    0xC0,
    0x00,
    0x00,
    0x00,

    // 'l'
    //    
    //    
    //    
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    // ## 
    //    
    //    
    //    
    //    
    //    
    //    
    //    
    0x00,
    0x00,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'm'
    //             
    //             
    //             
    //             
    //             
    //             
    //             
    // ## ### ###  
    // ########### 
    // ##   ##  ## 
    // ##   ##   # 
    // ##   ##   # 
    // ##   ##   # 
    // ##   ##   # 
    // ##   ##   # 
    // ##   ##   # 
    // ##   ##   # 
    //             
    //             
    //             
    //             
    //             
    //             
    //             
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xDD,
    0xC0,
    0xFF,
    0xE0,
    0xC6,
    0x60,
    0xC6,
    0x20,
    0xC6,
    0x20,
    0xC6,
    0x20,
    0xC6,
    0x20,
    0xC6,
    0x20,
    0xC6,
    0x20,
    0xC6,
    0x20,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'n'
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    // ## ###  
    // ####### 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xDC,
    0xFE,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'o'
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    //  ####   
    //  #####  
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    //  #####  
    //   ###   
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0x7C,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0x7C,
    0x38,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'p'
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    // ## ###  
    // ####### 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ####### 
    // ## ###  
    // ##      
    // ##      
    // ##      
    // ##      
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xDC,
    0xFE,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xFE,
    0xDC,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,

    // 'q'
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    //  ### ## 
    // ####### 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ####### 
    //  ### ## 
    //      ## 
    //      ## 
    //      ## 
    //      ## 
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x76,
    0xFE,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xFE,
    0x76,
    0x06,
    0x06,
    0x06,
    0x06,
    0x00,
    0x00,
    0x00,

    // 'r'
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    // ## ## 
    // ##### 
    // ##    
    // ##    
    // ##    
    // ##    
    // ##    
    // ##    
    // ##    
    // ##    
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xD8,
    0xF8,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 's'
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    //  #### 
    // ##### 
    // #     
    // ##    
    // ###   
    //   ### 
    //    ## 
    //    ## 
    // ##### 
    // ####  
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x78,
    0xF8,
    0x80,
    0xC0,
    0xE0,
    0x38,
    0x18,
    0x18,
    0xF8,
    0xF0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 't'
    //       
    //       
    //       
    //       
    //       
    //   #   
    //   #   
    // ##### 
    // ##### 
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  #### 
    //   ### 
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x20,
    0x20,
    0xF8,
    0xF8,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x78,
    0x38,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'u'
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ### ### 
    //  ### ## 
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xEE,
    0x76,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'v'
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    // ##    ## 
    // ##   ##  
    //  ##  ##  
    //  ##  ##  
    //  ##  #   
    //   # ##   
    //   # ##   
    //   ###    
    //   ###    
    //    ##    
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xC3,
    0x00,
    0xC6,
    0x00,
    0x66,
    0x00,
    0x66,
    0x00,
    0x64,
    0x00,
    0x2C,
    0x00,
    0x2C,
    0x00,
    0x38,
    0x00,
    0x38,
    0x00,
    0x18,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'x'
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    // ###  ## 
    //  ##  ## 
    //   # ##  
    //   ####  
    //    ##   
    //   ###   
    //   ####  
    //  ## ##  
    //  ##  ## 
    // ##   ## 
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xE6,
    0x66,
    0x2C,
    0x3C,
    0x18,
    0x38,
    0x3C,
    0x6C,
    0x66,
    0xC6,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'y'
    //          
    //          
    //          
    //          
    //          
    //          
    //          
    // ##    ## 
    // ##   ##  
    //  ##  ##  
    //  ##  ##  
    //  ##  #   
    //   # ##   
    //   ####   
    //   ###    
    //    ##    
    //    ##    
    //    ##    
    //   ##     
    // ####     
    // ###      
    //          
    //          
    //          
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0xC3,
    0x00,
    0xC6,
    0x00,
    0x66,
    0x00,
    0x66,
    0x00,
    0x64,
    0x00,
    0x2C,
    0x00,
    0x3C,
    0x00,
    0x38,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x18,
    0x00,
    0x30,
    0x00,
    0xF0,
    0x00,
    0xE0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'z'
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    //  ##### 
    //  ##### 
    //    ##  
    //    ##  
    //   ##   
    //   ##   
    //   #    
    //  ##    
    //  ##### 
    // ###### 
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x7C,
    0x7C,
    0x18,
    0x18,
    0x30,
    0x30,
    0x20,
    0x60,
    0x7C,
    0xFC,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'à'
    //        
    //        
    //        
    //  ##    
    //   ##   
    //    #   
    //        
    // #####  
    //  ##### 
    //     ## 
    //     ## 
    //  ##### 
    // ###### 
    // ##  ## 
    // #   ## 
    // #### # 
    //  ### # 
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x60,
    0x30,
    0x10,
    0x00,
    0xF8,
    0x7C,
    0x0C,
    0x0C,
    0x7C,
    0xFC,
    0xCC,
    0x8C,
    0xF4,
    0x74,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'â'
    //        
    //        
    //        
    //   ##   
    //  ####  
    //  #  ## 
    //        
    // #####  
    //  ##### 
    //     ## 
    //     ## 
    //  ##### 
    // ###### 
    // ##  ## 
    // #   ## 
    // #### # 
    //  ### # 
    //        
    //        
    //        
    //        
    //        
    //        
    //        
    0x00,
    0x00,
    0x00,
    0x30,
    0x78,
    0x4C,
    0x00,
    0xF8,
    0x7C,
    0x0C,
    0x0C,
    0x7C,
    0xFC,
    0xCC,
    0x8C,
    0xF4,
    0x74,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'è'
    //         
    //         
    //         
    //  ##     
    //   ##    
    //    #    
    //         
    //  ####   
    //  #####  
    // ##   #  
    // ##   #  
    // ####### 
    // ####### 
    // ##      
    // ##      
    //  #####  
    //   ####  
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x60,
    0x30,
    0x10,
    0x00,
    0x78,
    0x7C,
    0xC4,
    0xC4,
    0xFE,
    0xFE,
    0xC0,
    0xC0,
    0x7C,
    0x3C,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'é'
    //         
    //         
    //         
    //     ##  
    //    ##   
    //   ##    
    //         
    //  ####   
    //  #####  
    // ##   #  
    // ##   #  
    // ####### 
    // ####### 
    // ##      
    // ##      
    //  #####  
    //   ####  
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x0C,
    0x18,
    0x30,
    0x00,
    0x78,
    0x7C,
    0xC4,
    0xC4,
    0xFE,
    0xFE,
    0xC0,
    0xC0,
    0x7C,
    0x3C,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'ê'
    //         
    //         
    //         
    //   ##    
    //  ####   
    //  #  ##  
    //         
    //  ####   
    //  #####  
    // ##   #  
    // ##   #  
    // ####### 
    // ####### 
    // ##      
    // ##      
    //  #####  
    //   ####  
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x30,
    0x78,
    0x4C,
    0x00,
    0x78,
    0x7C,
    0xC4,
    0xC4,
    0xFE,
    0xFE,
    0xC0,
    0xC0,
    0x7C,
    0x3C,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'î'
    //       
    //       
    //       
    //  ##   
    // ####  
    // #  ## 
    //       
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //  ##   
    //       
    //       
    //       
    //       
    //       
    //       
    //       
    0x00,
    0x00,
    0x00,
    0x60,
    0xF0,
    0x98,
    0x00,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x60,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'ï'
    //     
    //     
    //     
    //     
    //   # 
    //   # 
    //     
    // ##  
    // ##  
    // ##  
    // ##  
    // ##  
    // ##  
    // ##  
    // ##  
    // ##  
    // ##  
    //     
    //     
    //     
    //     
    //     
    //     
    //     
    0x00,
    0x00,
    0x00,
    0x00,
    0x20,
    0x20,
    0x00,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0xC0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'ô'
    //         
    //         
    //         
    //   ##    
    //   # #   
    //  #  ##  
    //         
    //  ####   
    //  #####  
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    //  #####  
    //   ###   
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x30,
    0x28,
    0x4C,
    0x00,
    0x78,
    0x7C,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0x7C,
    0x38,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'û'
    //         
    //         
    //         
    //   ###   
    //   # #   
    //  #   #  
    //         
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ##   ## 
    // ### ### 
    //  ### ## 
    //         
    //         
    //         
    //         
    //         
    //         
    //         
    0x00,
    0x00,
    0x00,
    0x38,
    0x28,
    0x44,
    0x00,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xC6,
    0xEE,
    0x76,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // 'œ'
    //              
    //              
    //              
    //              
    //              
    //              
    //              
    //  ####  ###   
    //  ##########  
    // ##   ##   ## 
    // ##   ##   ## 
    // ##   ####### 
    // ##   ####### 
    // ##   ##      
    // ##   ##      
    //  ##########  
    //   ###  ####  
    //              
    //              
    //              
    //              
    //              
    //              
    //              
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x79,
    0xC0,
    0x7F,
    0xE0,
    0xC6,
    0x30,
    0xC6,
    0x30,
    0xC7,
    0xF0,
    0xC7,
    0xF0,
    0xC6,
    0x00,
    0xC6,
    0x00,
    0x7F,
    0xE0,
    0x39,
    0xE0,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,

    // '🔔' (custom bell bitmap)
    //    ###   
    //   #####  
    //  ####### 
    //  ####### 
    // #########
    // #########
    // #########
    // #########
    // #########
    // #########
    // #########
    // #########
    // #########
    // #########
    //  ####### 
    //          
    //    ###   
    //    ###   
    //          
    //          
    //          
    //          
    //          
    //          
    0x1C,
    0x00,
    0x7C,
    0x40,
    0xFC,
    0xC0,
    0xFB,
    0xC0,
    0xFF,
    0xC0,
    0xFF,
    0xC0,
    0xFF,
    0xC0,
    0xFF,
    0xC0,
    0xFF,
    0xC0,
    0xFF,
    0xC0,
    0xFF,
    0xC0,
    0xFF,
    0xC0,
    0xFD,
    0xC0,
    0xF0,
    0x00,
    0x01,
    0xC0,
    0x03,
    0x80,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00,
    0x00
};

} // namespace rr::ui
